// --- Comments only ---
//
// П.Колев
//
// Нови файлове:
// _announce.cpp  (15.feb.2000)
//
// ------------------------- Бързодействие -------------------------------
//
//   Ето някои особености, "изчистването" на които на теория би спомогнало
// са ускоряването на работата на написаната от мен част от програмата :
//
//   TRCDKeyToSidePair винаги зарежда адресите на страните. Но те по-често
// не се използуват. Добавянето към декларацията на конструктора на
// параметър, указващ дали да се зареждат адресите, би ускорило в известна
// степен работата (няма да се рови из T_ADDRESS). Може да се направи още
// нещо в този дух - в срочните книги не се използуват (освен евентуално
// указаните в парамеръра turnInvolvs) страните, за които функцията Suitor
// връща true. За тях може дори да не се зареждат имената на
// неизползуваните страни (няма да се рови из T_CITIZEN или T_FIRM).
//
//   В срочните книги правя обръщения към T_DECISION, T_GLOBAL_JUDGEMENT
// или T_LOCAL_JUDGEMENT, по принципа "ако има нещо, вадя", т.е., без да
// съм сигурен че в дадения случай трябва да се търси именно там.
// Изключването (ако е възможно) на такива предварително обречени
// търсения може би ще помогне.
//
//   В общия случай дадено лице (фирма) може да участвува като страна (и
// да трябва да се извади на печат) в повече от едно дело/заседание (в
// зависимост от книгата). Всеки път се прави отделно търсене в
// T_CITIZEN / T_FIRM. Казаното обикновено важи и за всички останали
// данни от базата.
//
//  Рекапитулациите и отчетите са пшостроени изключително върху
// "SELECT COUNT (*) ... ". Ако има по-добра идея, моля ...
// -----------------------------------------------------------------------
