INSERT INTO T_OLD_SUBJECT VALUES (0100, 'ГЛ.I. ПРЕСТЪПЛЕНИЯ ПРОТИВ РЕПУБЛИКАТА', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0101, 'ГЛ.I. Тероризъм - чл.108а НК', 'p', 'sjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0200, 'ГЛ.II. ПРЕСТЪПЛЕНИЯ ПРОТИВ ЛИЧНОСТТА', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0201, 'Гл.II. Убийства довършени - чл.115-118 НК', 'p', 'esjpJxbPA', 'slбcBJґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0202, 'Гл.II. Убийства опити - чл.115-118 НК', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0203, 'Гл.II. Причиняване на телесна повреда - чл.131, ал.1, т.8 НК', 'p', 'esjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0204, 'Гл.II. Отвличане на лица - чл.142 и чл.156 НК', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0205, 'Гл.II. Противозаконно лишаване от свобода - чл.142а, ал.2 НК', 'p', 'esjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0206, 'Гл.II. Трафик на хора - чл.159а-159в НК', 'p', 'esjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, NULL, 1, NULL, 5, NULL, 'crJdgІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0207, 'Гл.II. Закана за убийство-чл.144, ал.3 ,вр. ал.1 НК', 'p', 'esjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0208, 'Гл.II. Склоняване към проституция - чл.155, ал.5, т.1 НК', 'p', 'esjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, NULL, 1, NULL, 2, NULL, 'crJdgІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0300, 'ГЛ.III. ПРЕСТЪПЛЕНИЯ ПРОТИВ ПРАВАТА НА ГРАЖДАНИТЕ', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0400, 'ГЛ.IV. ПРЕСТЪПЛЕНИЯ ПРОТИВ БРАКА, СЕМЕЙСТВОТО И МЛАДЕЖТА', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0500, 'ГЛ.V. ПРЕСТЪПЛЕНИЯ ПРОТИВ СОБСТВЕНОСТТА', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0504, 'Гл.V. Кражба - чл.194-197 НК', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0505, 'Гл.V. Грабеж - чл.198-200 НК', 'p', 'bjspJAP', 'lSjdBscбґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0507, 'Гл.V. Присвояване - чл.201-208 НК', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0511, 'Гл.V. Измама - чл.212, 212а,212б НК', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0513, 'Гл.V. Изнудване /рекет/ - чл.213а, чл.214 и чл.214а НК', 'p', 'esjpJbPA', 'slбcBJґdjSS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0600, 'ГЛ.VI. ПРЕСТЪПЛЕНИЯ ПРОТИВ СТОПАНСТВОТО', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0601, 'Гл.VI. Пасивен и активен подкуп - чл.224, чл.225б и 226в НК', 'p', 'sjpJPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0602, 'Гл.VI. Контрабанда  - чл.242, ал.1, б."ж" НК', 'p', 'esjpJPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0603, 'Гл.VI. Престъпления против паричната и кредитна система - чл.243-252 НК', 'p', 'sjpJPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0700, 'ГЛ.VII. ПРЕСТЪПЛЕНИЯ ПРОТИВ ФИНАНСОВАТА, ДАНЪЧНАТА И ОСИГУРИТЕЛНАТА СИСТЕМИ', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0701, 'Гл.VII. Сделки със средства от трафик на наркотични вещества - чл.253, ал.4 НК', 'p', 'jspJAP', 'lSjdBscбґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0702, 'Гл.VII. Нарушаване разпоредбите на ЗМСИП от дл.л. - чл.253б НК', 'p', 'sjpJPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0703, 'Гл.VII. Укриване и неплащане на данъчни задължения - чл.255-257 НК', 'p', 'jspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0800, 'ГЛ.VIII. ПРЕСТЪПЛЕНИЯ ПРОТИВ ДЕЙНОСТТА НА ДЪРЖАВНИ ОРГАНИ И ОБЩЕСТВЕСТВЕНИ ОРГАНИЗАЦИИ', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0801, 'Гл.VIII. Превеждане на лица през граница и групи - чл.280, ал.2, т.5', 'p', 'esjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0802, 'Гл.VIII. Превишаване на власт - чл.282-283б НК', 'p', 'esjpJbPA', 'slcBJґdjЉSБS', 'O', NULL, NULL, NULL, NULL, 1, NULL, 2, NULL, 'crJdЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0803, 'Гл.VIII. Подкуп на чуждо длъжностно лице - чл.304, ал.3 НК', 'p', 'sjpJPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0804, 'Гл.VIII. Подкуп с цел упражняване на влияние - чл.304б НК', 'p', 'sjpJPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0805, 'Гл.VIII. Посредничество за подкуп - чл.305 б."а" НК', 'p', 'sjpJPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0806, 'Гл.VIII. Други подкупи по чл.301-307а НК', 'p', 'sjpJPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0900, 'ГЛ.IX, IXа. ДОКУМЕНТНИ И КОМПЮТЪРНИ ПРЕСТЪПЛЕНИЯ', 'p', 'jspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (0910, 'Гл.IX. Компютърни престъпления по гл.IXа', 'p', 'sjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1000, 'ГЛ.X.  ПРЕСТЪПЛЕНИЯ ПРОТИВ ОБЩЕСТВЕНОТО СПОКОЙСТВИЕ', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1002, 'Гл.X.  Организиране и ръководене на престъпна група - чл.321, чл.321а НК', 'p', 'esjpJbPA', 'slбcBJґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1100, 'ГЛ.XI. ОБЩООПАСНИ ПРЕСТЪПЛЕНИЯ', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1101, 'Гл.XI. Палеж - чл.330, ал.2 и 3 НК', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1102, 'Гл.XI. Държане на оръжие и боеприпаси - чл. 339, ал.2 и ал.3', 'p', 'esjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1104, 'Гл.XI. Причиняване на смърт в транспорта - чл.343, ал.1 б."в" НК', 'p', 'sjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1105, 'Гл.XI. Отнемане на МПС - чл.346, ал.6 НК', 'p', 'esjpJbPA', 'slбcBґdjЉSБS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'crJdgЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1106, 'Гл.XI. Пренасяне, изготвяне, търговия и др. на наркотични вещества - чл.354а, б, в, и чл.356а и др.', 'p', 'bjspJAP', 'lSjdBscбБЉґZS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1107, 'Гл.XI. Други общоопасни престъпления чл.356б и др.', 'p', 'esjpJbPA', 'slбcBґdjЉS', 'O', NULL, NULL, NULL, NULL, 1, NULL, 2, NULL, 'crJdЗ4ZІ', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1200, 'ГЛ.XII. ПРЕСТЪПЛЕНИЯ ПРОТИВ ОТБРАНИТЕЛНАТА СПОСОБНОСТ НА РЕПУБЛИКАТА', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1202, 'Гл.XII. Разгласяване на сведения със секретна информация - чл.357-360 НК', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1300, 'ГЛ.XIII. ВОЕННИ ПРЕСТЪПЛЕНИЯ', 'p', 'bjspJAP', 'lSjdBscбБЉґS', 'O', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 2, NULL, 'JdZcЗrg4І', 1018, '860, 861, 863, 870, 888, 898, 901, 903, 905, 938, 940, 941, 943, 947, 953, 954, 1640, 924, 14136, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1400, 'Чл.70-71 НК - предсрочно освобождаване', 'p', 'esjpJ3buAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1017, '883, 925, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1500, 'Чл.80-88 от НК - давност, амнистия, реабилитация', 'p', 'bujspJA', 'lSpdBscS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'JdZcЗrg4І', 1019, '14117, 14118, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1800, 'Чл.23, 25 и 27 НК - кумулация', 'p', 'bujspJA', 'lSpdBscS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'JdZcЗrg4І', 1017, '1718, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (1900, 'Чл.78а НК', 'p', 'bjspJAP', 'lSpdcspS', 'D', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 5, NULL, 'JdZcЗrg4І', 1018, '860, 861, 870, 898, 901, 903, 940, 941, 953, 954, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2000, 'Административни дела', 'p', 'bjspJAP', 'lsdpScS', 'D', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 4, NULL, 'JdZcЗrg4І', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2100, 'НЧХД', 'p', 'bjspJA', 'lSjdBscбБЉґS', 'Г', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 3, NULL, 'JdZcЗrg4І', 1018, '861, 870, 898, 901, 903, 940, 941, 953, 954, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2200, 'НЧД от досъдебното производство', 'p', 'esjpJ3buAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1014, '863, 877, 888, 903, 926, 930, 932, 947, 953, 954, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2201, 'Чл.61, ал.3 НПК - обжалване на МНО "Парична гаранция"', 'p', 'esjpJ3uPAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1014, '926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2202, 'Чл.61, ал.5 НПК - изменение на МНО "Парична гаранция"', 'p', 'esjpJ3uPAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1014, '863, 888, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2203, 'Чл.62, ал.2 НПК - вземане на МНО "Домашен арест"', 'p', 'sjpJ3uPAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1014, '877, 947, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2204, 'Чл.64 НПК - вземане на МНО "Задържане под стража"', 'p', 'sjpJ3uPAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1014, '877, 947, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2205, 'Чл.65 НПК - изменение на МНО "Задържане под стража"', 'p', 'sjpJ3uPAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1014, '863, 888, 926, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2206, 'Чл.68, ал.4 НПК - обжалване забрана за напускане на РБ', 'p', 'esjpJ3uAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1014, '938, 961, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2207, 'Чл.69, ал.1 НПК - отстраняване от длъжност', 'p', 'esjpJ3uAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2208, 'Чл.70, ал.1 НПК - настаняване в психиатрично заведение', 'p', 'esjpJ3uAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2209, 'Чл.72 НПК - обезпечение на глоба и конфискация', 'p', 'sjpJ3uAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2210, 'Чл.73 НПК - обезпечение на граждански иск', 'p', 'sjpJ3uAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2211, 'Чл.111, ал.3 НПК - обжалване отказ за връщане на веществени доказателства', 'p', 'esjpJ3uAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2212, 'Чл.141а НПК - разпит на служител под прикритие', 'p', 'esjpJ3buAD', 'lc0S', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 2, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2213, 'Чл.161 НПК - претърсване, изземване', 'p', 'sjpJ3uAK', 'ldS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2214, 'Чл.164 НПК - обиск', 'p', 'sjpJ3uAK', 'ldS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2215, 'Чл.165, ал.2 НПК - задържане изземването на кореспонденция', 'p', 'esjpJ3uAK', 'ldS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2216, 'Чл.222 НПК - разпит на обвиняем', 'p', 'esjpJ3uA', 'lc0S', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2217, 'Чл.223 НПК - разпит на свидетел', 'p', 'esjpJ3uA', 'lc0S', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2218, 'Чл.243, ал.3 НПК - обжалване прекратяване на НП', 'p', 'esjpJuAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1014, '930, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2219, 'Чл.244, ал.5 НПК - обжалване спиране на НП', 'p', 'esjpJuAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1014, '932, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2220, 'Чл.368 НПК - искане от обвиняемия за разглеждане делото в съда', 'p', 'esjpJuAK', 'lcdS', 'I', NULL, NULL, NULL, NULL, 1, NULL, 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2221, 'Разкриване на банкова тайна чл.62', 'p', 'esjpJ3bIuAKD', 'lcdS', 'I', NULL, NULL, NULL, NULL, 1, NULL, 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2222, 'Чл.68, ал.5 НПК - обжалване забрана за напускане на РБ', 'p', 'esjpJ3uAK', 'lcdS', 'I', NULL, NULL, NULL, NULL, 1, NULL, 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2223, 'Чл.158, ал.3 НПК - освидетелстване', 'p', 'esjpJ3uAKD', 'ldS', 'I', NULL, NULL, NULL, NULL, 1, NULL, 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2300, 'Други дела', 'p', 'esjpJ3buAK', 'lЎcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1019, '880, 885, 906, 948, 957, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2301, 'Чл.444 НПК - отмяна зачитането на работни дни при лишаване от свобода', 'p', 'esjpJ3uAK', 'lcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', 1017, '896, 955, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2302, 'Чл.446 НПК - замяна на затворнически режим', 'p', 'ujspJKA', 'ldcS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'JdZcЗrg4І', 1017, '958, 962, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2303, 'Чл.448 НПК - прекъсване на изпълнението на наказание', 'p', 'ujspJKA', 'ldcS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'JdZcЗrg4І', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2304, 'Чл.451 НПК - замяна на наказанието пробация с лишаване от свобода', 'p', 'ujspJKA', 'ldcS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'JdZcЗrg4І', 1017, '957, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (2305, 'Международна правна помощ по наказателни дела - чл.453 и сл. НПК', 'p', 'esjpJ3uAK', 'lЎcdS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (2306, 'Екстрадиция', 'p', 'esjpJ3uA', 'splcBdSS', 'I', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', 6, NULL, 'crJdgЗ4ZІ', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (3400, 'Касационни производства', 'p', 'bujspJxAF', 'lSpdBscS', 'U', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (3410, 'Частни касационни производства', 'p', 'bujspJxA', 'lSpdBscS', 'U', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (9000, 'ВНОХД', 'p', 'bujspJxA', 'lSpdjcS', 'W', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', 1025, '860, 861, 863, 865, 870, 888, 890, 903, 926, 929, 938, 940, 941, 943, 945, 947, 950, 953, 954, 1640, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (9010, 'Обжалвани дела по чл.414г НПК', 'p', 'bujspJxAF', 'lSpdjcS', 'W', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 3, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (9100, 'ВНЧХД', 'p', 'bujspJxA', 'lSpdjcS', 'C', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 4, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', 1025, '861, 865, 870, 890, 903, 929, 940, 945, 950, 953, 954, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (9200, 'ВЧНД', 'p', 'bujspJxA', 'lSpdjcS', 'H', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 5, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', 1024, '893, 927, 955, 957, 958, 896, 945, 891, 928, 948, 14117, 14118, 15347, 15348, 904, 947, 877, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (9201, 'Мерки по чл.64 НПК - досъдебно производство', 'p', 'bujspJxA', 'lSpdjcS', 'H', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 5, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', 1016, '863, 888, 926, 15347, 15348, 904, 947, 877, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (9202, 'Мерки по чл.65 НПК - досъдебно производство', 'p', 'bujspJxA', 'lSpdjcS', 'H', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 5, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', 1016, '863, 888, 926, 15347, 15348, 904, 947, 877, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (9203, 'Разпити - досъдебно производство', 'p', 'bujspJxA', 'lSpdjcS', 'H', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 5, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (9204, 'Други НЧД от досъдебното производство', 'p', 'bujspJxA', 'lSpdjcS', 'H', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 5, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', 1016, '863, 888, 926, 15347, 15348, 904, 947, 877, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (9205, 'Чл.243 НПК', 'p', 'bujspJxA', 'lSpdjcS', 'H', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 5, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', 1014, '930, 15347, 15348, 904, 947, 877, 910, 930, 932');
INSERT INTO T_OLD_SUBJECT VALUES (9206, 'Чл.288 НПК', 'p', 'bujspJxA', 'lSpdjcS', 'H', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 5, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', NULL, NULL);
INSERT INTO T_OLD_SUBJECT VALUES (9500, 'ВНАХД', 'p', 'bujspJxAF', 'lSpdBscS', 'П', NULL, NULL, NULL, '                                                                     *    ***       ****  *         ', 6, '                                       *********           *    **                                  ', NULL, NULL, 'JdZcЗg4І', 1025, '860, 861, 865, 870, 890, 903, 929, 940, 943, 945, 950, 953, 954, 15347, 15348, 904, 910, 930, 932');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (010000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ РЕПУБЛИКАТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (010100, 'p', 'O', NULL, 'Измяна');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (010200, 'p', 'O', NULL, 'Предателство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (010300, 'p', 'O', NULL, 'Убийство или телесна повреда на представител на чужда държава с противодържавна цел');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (010400, 'p', 'O', NULL, 'Участие във военни действия на страната на неприятелска държава');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (010500, 'p', 'O', NULL, 'Поставяне в услуга на чужда държава');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (010600, 'p', 'O', NULL, 'Умишлено увреждане на отбранителната способност чрез бунт в армията');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (010700, 'p', 'O', NULL, 'Изпълнение на държавна служба във вреда на републиката');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (010800, 'p', 'O', NULL, 'Приготовление за шпионство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (010900, 'p', 'O', NULL, 'Шпионство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (011000, 'p', 'O', NULL, 'Диверсия');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (011100, 'p', 'O', NULL, 'Вредителство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (011200, 'p', 'O', NULL, 'Престъпления по чл.108 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (011300, 'p', 'O', NULL, 'Тероризъм');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (011400, 'p', 'O', NULL, 'Образуване или ръководене на организация или група');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (020000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ ЛИЧНОСТТА - Убийства');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (020100, 'p', 'O', NULL, 'Убийство по чл.115 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (020200, 'p', 'O', NULL, 'Квалифицирани състави на убийство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (020300, 'p', 'O', NULL, 'Убийство на съдия, прокурор,следовател, полицейски орган, разследващ полицай, държавен или частен съдебен изпълнител и помощник - частен съдебен изпълнител, митнически и данъчен служител');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (020400, 'p', 'O', NULL, 'Приготовление за убийство по чл.115 чл.116 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (020500, 'p', 'O', NULL, 'Убийство в състояние на силно раздразнение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (020600, 'p', 'O', NULL, 'Убийство при превишаване пределите на неизбежната отбрана');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (020700, 'p', 'O', NULL, 'Убиийство от майка на рожба и убийство на новородено с чудовищен вид');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (020800, 'p', 'O', NULL, 'Убийство по непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (020900, 'p', 'O', NULL, 'Убийство по непредпазливост с огнестрелно оръжие, отровно вещество или две или повече лица');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (021000, 'p', 'O', NULL, 'Лишаване от живот при професионална непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (021100, 'p', 'O', NULL, 'Непредпазливо убийство вследствие на умишлено нанесена телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (021200, 'p', 'O', NULL, 'Криминален аборт');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (021300, 'p', 'O', NULL, 'Подпомагане или склоняване към самоубийство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (021400, 'p', 'O', NULL, 'Опит за убийство по чл.115 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (021500, 'p', 'O', NULL, 'Опит за убийство по чл.116 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (021600, 'p', 'O', NULL, 'Опит за убийство по чл.118 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (030000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ ЛИЧНОСТТА - Телесни повреди');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (030100, 'p', 'O', NULL, 'Тежка телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (030200, 'p', 'O', NULL, 'Средна телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (030300, 'p', 'O', NULL, 'Лека телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (030400, 'p', 'O', NULL, 'Лека телесна повреда без разстройство на здравето');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (030500, 'p', 'O', NULL, 'Квалифицирани състави на телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (030600, 'p', 'O', NULL, 'Тежка, средна телесна повреда на съдия, прокурор,следовател, лице от състава на МВ, държавен или частен съдебен изпълнител и помощник - частен съдебен изпълнител, митнически и данъчен служител');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (030700, 'p', 'O', NULL, 'Лека телесна повреда на съдия, прокурор,следовател, лице от състава на МВ, държавен или частен съдебен изпълнител и помощник - частен съдебен изпълнител, митнически и данъчен служител');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (030800, 'p', 'O', NULL, 'Тежка или средна телесна повреда, представляваща опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (030900, 'p', 'O', NULL, 'Телесна повреда, причинена в състояние на силно раздразнение и превишаване пределите на неизбежната отбрана');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (031000, 'p', 'O', NULL, 'Тежка или средна телесна повреда, причинена по непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (031100, 'p', 'O', NULL, 'Тежка или средна повреда, причинена при професионална непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (031200, 'p', 'O', NULL, 'Заразяване с венерическа болест');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (040000, 'p', 'O', NULL, 'ДРУГИ ПРЕСТЪПЛЕНИЯ ПРОТИВ ЛИЧНОСТТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (040100, 'p', 'O', NULL, 'Излагане на опасност живота или здравето на трудещите се');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (040200, 'p', 'O', NULL, 'Излагане на опасност живота на другиго');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (040300, 'p', 'O', NULL, 'Неоказване помощ на лице, намиращо се в безпомощно състояние');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (040400, 'p', 'O', NULL, 'Неоказване на помощ при опасност за живота на друго лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (040500, 'p', 'O', NULL, 'Неоказване на помощ при ПТП');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (040600, 'p', 'O', NULL, 'Бездействие на медицинско лице спрямо болен или родилка');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (040700, 'p', 'O', NULL, 'Отвличане');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (040800, 'p', 'O', NULL, 'Квалифицирани състави на отвличане');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (040900, 'p', 'O', NULL, 'Отвличане по чл. 142, ал.3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (041000, 'p', 'O', NULL, 'Приготовление за отвличане');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (041100, 'p', 'O', NULL, 'Противозаконно лишаване от свобода');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (041200, 'p', 'O', NULL, 'Противозаконно лишаване от свобода от длъжностно лице, представител на обществеността в нарушение на службата или функцията му, от охранител, застраховател или лице от състава на МВР, от лице, действащо по поръчение на организирана престъпна група');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (041300, 'p', 'O', NULL, 'Противозаконно лишаване от свобода на бременна жена, малолетно или непълнолетно лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (041400, 'p', 'O', NULL, 'Противозаконно лишаване от свобода по начин, мъчителен и опасен за здравето на пострадалия или продължило повече от две денонощия');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (041500, 'p', 'O', NULL, 'Съзнателно настаняване или задържане на здраво лице в болнично заведение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (041600, 'p', 'O', NULL, 'Принуда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (041700, 'p', 'O', NULL, 'Принуда по чл. 143 ал. 3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (041800, 'p', 'O', NULL, 'Задържане на заложници');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (041900, 'p', 'O', NULL, 'Закана с убийство или с друго престъпление против личността и имота на другиго');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (042000, 'p', 'O', NULL, 'Издаване на чужда тайна');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (042100, 'p', 'O', NULL, 'Издаване на чужда тайна чрез СРС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (042200, 'p', 'O', NULL, 'Обида и квалифицирана обида');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (042300, 'p', 'O', NULL, 'Клевета и квалифицирана клевета');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (042400, 'p', 'O', NULL, 'Блудство с лице, ненавършило 14 г.');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (042500, 'p', 'O', NULL, 'Квалфицирани състави на блудство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (042600, 'p', 'O', NULL, 'Блудство с лице, навършило 14 г.');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (042700, 'p', 'O', NULL, 'Съвкупление с лице, ненавършило 14г. или с лице, навършило 14 г., неразбиращо свойството и значението на извършеното');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (042800, 'p', 'O', NULL, 'Изнасилване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (042900, 'p', 'O', NULL, 'Квалифицирани състави на изнасилване - чл.152 ал.2 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (043000, 'p', 'O', NULL, 'Квалифицирани състави на изнасилване - чл.152 ал.3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (043100, 'p', 'O', NULL, 'Квалифицирани състави на изнасилване - чл.152 ал.4 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (043200, 'p', 'O', NULL, 'Съвкупление чрез използване на служебна или материална зависимост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (043300, 'p', 'O', NULL, 'Съвкупление между възходящи и низходящи, братя и сестри, осиновители и осиновени');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (043400, 'p', 'O', NULL, 'Развратни действия с непълнолетно проституиращо лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (043500, 'p', 'O', NULL, 'Склоняване към проституция');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (043600, 'p', 'O', NULL, 'Извършване на развратни действия чрез изнудване с използване на интернет информация');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (043700, 'p', 'O', NULL, 'Склоняване на непълнолетен за участие или наблюдение на развратни действия');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (043800, 'p', 'O', NULL, 'Отвличане с цел предоставяне за развратни действия');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (043900, 'p', 'O', NULL, 'Квалифицирани състави на отвличане с цел предоставяне за развратни действия - чл.156 ал.2 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (044000, 'p', 'O', NULL, 'Квалифицирани състави на отвличане с цел предоставяне за развратни действия - чл.156 ал.3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (044100, 'p', 'O', NULL, 'Хомосексуални действия, осъществени чрез принуда или използване положение на зависимост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (044200, 'p', 'O', NULL, 'Развратни действия с непълнолетни');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (044300, 'p', 'O', NULL, 'Разпространение на порнографски материали');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (044400, 'p', 'O', NULL, 'Трафик на хора - чл.159а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (044500, 'p', 'O', NULL, 'Трафик на хора - чл.159б НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (044600, 'p', 'O', NULL, 'Използване на лице, пострадало от трафик на хора');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (044700, 'p', 'O', NULL, 'Трафик на хора, представляващ опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (050000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ ПРАВАТА НА ГРАЖДАНИТЕ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (050100, 'p', 'O', NULL, 'Против националното и расовото равенство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (050200, 'p', 'O', NULL, 'Против изповеданията');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (050300, 'p', 'O', NULL, 'Против политическите права на гражданите');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (050400, 'p', 'O', NULL, 'Нарушаване неприкосновеността на жилището и кореспонденцията');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (050500, 'p', 'O', NULL, 'Престъпления против трудовите права на гражданите');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (050600, 'p', 'O', NULL, 'Престъпление против авторските права');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (050700, 'p', 'O', NULL, 'Престъпления против интелектуалната собственост - чл.172б НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (050800, 'p', 'O', NULL, 'Плагиатство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (050900, 'p', 'O', NULL, 'Престъпления против интелектуалната собственост - чл.174 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (051000, 'p', 'O', NULL, 'Престъпления против свободата на събранията, митингите и манифестациите');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (060000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ БРАКА, СЕМЕЙСТВОТО И МЛАДЕЖТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (060100, 'p', 'O', NULL, 'Престъпления против брака и семейството');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (060200, 'p', 'O', NULL, 'Изоставяне на дете по користни подбуди или принуда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (060300, 'p', 'O', NULL, 'Съгласие за продажба на дете');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (060400, 'p', 'O', NULL, 'Неплащане на издръжка');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (060500, 'p', 'O', NULL, 'Престъпления против децата');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (060600, 'p', 'O', NULL, 'Престъпления против младежта');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (060700, 'p', 'O', NULL, 'Упиване с алкохолни напитки на непълнолетни');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (070000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ СОБСТВЕНОСТТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (070100, 'p', 'O', NULL, 'Кражба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (070200, 'p', 'O', NULL, 'Квалифицирани състави на кражба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (070300, 'p', 'O', NULL, 'Кражба в големи размери');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (070400, 'p', 'O', NULL, 'Кражба на взривни вещества,огнестрелни оръжия или боеприпаси от структурните звена на МВР, МО, от Българската армия, от структурите на подчинение на министъра на отбраната и от Държавна агенция Държавен резерв и военновременни запаси');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (070500, 'p', 'O', NULL, 'Кражба, представляваща опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (070600, 'p', 'O', NULL, 'Кражба в особено големи размери, представляваща особено тежък случай');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (070700, 'p', 'O', NULL, 'Привилегирован състав на кражба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (070800, 'p', 'O', NULL, 'Грабеж');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (070900, 'p', 'O', NULL, 'Квалифицирани състави на грабеж - чл.199 ал.1 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (071000, 'p', 'O', NULL, 'Квалифицирани състави на грабеж - чл.199 ал.2 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (071100, 'p', 'O', NULL, 'Приготовление за грабеж');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (071200, 'p', 'O', NULL, 'Длъжностно присвояване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (071300, 'p', 'O', NULL, 'Длъжностно присвояване, за улесняването на което е извършено и друго престъпление, не по- тежко наказуемо');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (071400, 'p', 'O', NULL, 'Длъжностно присвояване в големи размери');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (071500, 'p', 'O', NULL, 'Длъжностно присвояване в особено големи размери, представляващо особено тежък случай');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (071600, 'p', 'O', NULL, 'Маловажни случаи на длъжностно присвояване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (071700, 'p', 'O', NULL, 'Привилегирован състав на длъжностно присвояване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (071800, 'p', 'O', NULL, 'Обсебване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (071900, 'p', 'O', NULL, 'Обсебване в големи размери или представляващо опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (072000, 'p', 'O', NULL, 'Обсебване в особено големи размери, представляващо особено тежък случай');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (072100, 'p', 'O', NULL, 'Присвояване на намерена или случайно попаднала у дееца вещ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (072200, 'p', 'O', NULL, 'Присвояване на съкровище');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (072300, 'p', 'O', NULL, 'Измама');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (072400, 'p', 'O', NULL, 'Квалифицирани състави на измама');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (072500, 'p', 'O', NULL, 'Измама по чл. 209 ал. 1 и 2 и чл. 210 в особено големи размери, особено тежък случай или опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (072600, 'p', 'O', NULL, 'Документна измама');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (072700, 'p', 'O', NULL, 'Документна измама, при която полученото без правно основание имущество е от фондове на Европейския съюз или предоставено от тях на българската държава');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (072800, 'p', 'O', NULL, 'Документна измама в големи размери или представляваща опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (072900, 'p', 'O', NULL, 'Документна измама в особено големи размери');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (073000, 'p', 'O', NULL, 'Измама по чл.212а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (073100, 'p', 'O', NULL, 'Привилегирован състав на измама');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (073200, 'p', 'O', NULL, 'Застрахователна измама');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (073300, 'p', 'O', NULL, 'Рекет');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (073400, 'p', 'O', NULL, 'Квалифицирани състави на рекет - чл.213а, ал.2 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (073500, 'p', 'O', NULL, 'Квалифицирани състави на рекет - чл.213а, ал.3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (073600, 'p', 'O', NULL, 'Квалифицирани състави на рекет - чл.213а, ал.4 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (073700, 'p', 'O', NULL, 'Изнудване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (073800, 'p', 'O', NULL, 'Квалифицирани състави на изнудване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (073900, 'p', 'O', NULL, 'Вещно укривателство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (074000, 'p', 'O', NULL, 'Унищожаване и повреждане');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (074100, 'p', 'O', NULL, 'Злоупотреба на доверие');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (080000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ СТОПАНСТВОТО');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (080100, 'p', 'O', NULL, 'Безстопанственост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (080200, 'p', 'O', NULL, 'Умишлена безстопанственост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (080300, 'p', 'O', NULL, 'Безстопанственост в особено големи размери, представляваща особено тежък случай');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (080400, 'p', 'O', NULL, 'Сключване на неизгодна сделка по в това число и квалифициран състав');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (080500, 'p', 'O', NULL, 'Извършване на строителство върху земеделска земя');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (080600, 'p', 'O', NULL, 'Даване на неверни данни за извършената работа');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (080700, 'p', 'O', NULL, 'Промишлен шпионаж');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (080800, 'p', 'O', NULL, 'Сделки по цени над определените');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (080900, 'p', 'O', NULL, 'Получаване на неследващи се имотни облаги');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (081000, 'p', 'O', NULL, 'Частна стопанска дейност под прикритието на държавна или обществена организация. Наемане на работа на незаконно пребиваващ на територията на РБ чужденец.');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (081100, 'p', 'O', NULL, 'Престъпления против кредиторите');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (081200, 'p', 'O', NULL, 'Престъпления против промишлеността');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (081300, 'p', 'O', NULL, 'Престъпления против търговията');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (081400, 'p', 'O', NULL, 'Продажба и държане на акцизни стоки без бандерол');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (081500, 'p', 'O', NULL, 'Извършване на търговска дейност без разрешение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (081600, 'p', 'O', NULL, 'Неправомерно присъедняване към електропреносна и други мрежи или системи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (081700, 'p', 'O', NULL, 'Престъпления против горското стопанство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (081800, 'p', 'O', NULL, 'Престъпления против ловното и рибното стопанство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (081900, 'p', 'O', NULL, 'Контрабанда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (082000, 'p', 'O', NULL, 'Контрабанда по чл. 242, ал.1, б. а, б, в, д, е, ж, з НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (082100, 'p', 'O', NULL, 'Контрабанда на оръжие, взривове и боеприпаси');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (082200, 'p', 'O', NULL, 'Контрабанда на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (082300, 'p', 'O', NULL, 'Контрабанда на прекурсори или съоръжения и материали за производство на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (082400, 'p', 'O', NULL, 'Квалифицирани състави на контрабанда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (082500, 'p', 'O', NULL, 'Контрабанда на стоки за транзитен пренос');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (082600, 'p', 'O', NULL, 'Престъпления против паричната и кредитна система');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (082700, 'p', 'O', NULL, 'Придобиване или прокарване в обръщение на подправени парични знаци или платежни инструменти');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (082800, 'p', 'O', NULL, 'Престъпление по чл. 244а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (082900, 'p', 'O', NULL, 'Приемане и прокарване на подправен паричен знак');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083000, 'p', 'O', NULL, 'Получаване на кредит чрез представяне на неверни сведения');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083100, 'p', 'O', NULL, 'Използване на платежен инструмент с неверни данни или без съгласието на титуляра');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083200, 'p', 'O', NULL, 'Нарушения на валутния режим - чл.250 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083300, 'p', 'O', NULL, 'Нарушения на валутния режим - чл.251 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083400, 'p', 'O', NULL, 'Извършване по занятие на банкови, застрахователни и други финансови сделки без съответно разрешение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083450, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ СРЕЩУ ДАНЪЧНАТА, ФИНАНСОВАТА И ОСИГУРИТЕЛНА СИСТЕМИ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083500, 'p', 'O', NULL, 'Пране на пари, приготовление и сдружаване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083600, 'p', 'O', NULL, 'Квалифицирани състави на пране на пари');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083700, 'p', 'O', NULL, 'Нарушаване разпоредбите на Закона за мерките срещу изпирането на пари от длъжностно лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083800, 'p', 'O', NULL, 'Престъпления, свързани с нарушаване на бюджетната дисциплина');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (083900, 'p', 'O', NULL, 'Укриване и неплащане на данъчни задължения, вноски за ДОО и здравно осигуряване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (084000, 'p', 'O', NULL, 'Противозаконно противодействие на данъчен орган');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (084100, 'p', 'O', NULL, 'Създаване на юридическо лице с идеална цел с цел получаване на неследваща се имотна облага');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (084200, 'p', 'O', NULL, 'Представяне на невярно заключение от лицензиран оценител или одитор');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (090000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ ДЕЙНОСТТА НА ДЪРЖАВНИТЕ ОРГАНИ И ОБЩЕСТВЕНИТЕ ОРГАНИЗАЦИИ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (090100, 'p', 'O', NULL, 'Престъпления против реда на управлението');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (090200, 'p', 'O', NULL, 'Престъпление относно нарушаване мярките за административен надзор');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (090300, 'p', 'O', NULL, 'Самоволно извършване на действия по служба, която деецът не заема');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (090400, 'p', 'O', NULL, 'Неправомерно държане или ползване на формено облекло или служебни знаци');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (090500, 'p', 'O', NULL, 'Подправяне, разпространение, ползване и унищожаване на официални удостоверителни знаци');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (090600, 'p', 'O', NULL, 'Противоправно търсене и извършване на теренни археологически разкопки или подводни проучвания');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (090700, 'p', 'O', NULL, 'Откриване и несъобщаване, унищожаване или повреждане на културна ценност');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (090800, 'p', 'O', NULL, 'Извършване на археологически разкопки и отчуждаване на културни ценности');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (090900, 'p', 'O', NULL, 'Унищожаване или повреждане на защитени територии, растителни или животински видове');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (091000, 'p', 'O', NULL, 'Незаконно преминаване през граница');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (091100, 'p', 'O', NULL, 'Незаконно превеждане през граница');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (091200, 'p', 'O', NULL, 'Противозаконно подпомагане н чужденец да пребивава в страната в нарушение на закона');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (091300, 'p', 'O', NULL, 'Основен състав на престъпление по служба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (091400, 'p', 'O', NULL, 'Квалифицирани състави на престъпление по служба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (091500, 'p', 'O', NULL, 'Престъпление по служба - чл.282а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (091600, 'p', 'O', NULL, 'Престъпление по служба - чл.283 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (091700, 'p', 'O', NULL, 'Престъпление по служба - чл.283а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (091800, 'p', 'O', NULL, 'Престъпление по служба - чл.283б НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (091900, 'p', 'O', NULL, 'Престъпление по служба - чл.284 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (092000, 'p', 'O', NULL, 'Престъпление по служба - чл.284а - чл.284в НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (092100, 'p', 'O', NULL, 'Престъпление по служба - чл.285 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (092200, 'p', 'O', NULL, 'Набедяване в престъпление пред орган на власт');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (092300, 'p', 'O', NULL, 'Упражняване принуда спрямо обвиняем, свидетел или експерт и манипулиране на технически записи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (092400, 'p', 'O', NULL, 'Престъпление против правосъдието');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (092500, 'p', 'O', NULL, 'Лъжесвидетелстване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (092600, 'p', 'O', NULL, 'Изготвяне и представяне на невярно заключение от вещо лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (092700, 'p', 'O', NULL, 'Подбуждане към престъпление по чл. 290 - 291 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (092800, 'p', 'O', NULL, 'Умишлено неизпълнение на парично задължение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (092900, 'p', 'O', NULL, 'Лично укривателство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (093000, 'p', 'O', NULL, 'Неизпълнение на съдебно решение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (093100, 'p', 'O', NULL, 'Бягство на затворник');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (093200, 'p', 'O', NULL, 'Подкуп');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (093300, 'p', 'O', NULL, 'Квалифицирани състави на подуп');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (093400, 'p', 'O', NULL, 'Подкуп в особено големи размери, представляващ особено тежък случай');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (093500, 'p', 'O', NULL, 'Подкуп на длъжностно лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (093600, 'p', 'O', NULL, 'Подкуп на длъжностно лице, заемащо отговорно служебно положение, включително съдия, съдебен заседател, прокурор или следовател');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (093700, 'p', 'O', NULL, 'Подкуп от и на чуждо длъжностно лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (093800, 'p', 'O', NULL, 'Подкуп с цел упражняване на влияние');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (093900, 'p', 'O', NULL, 'Подкуп, получен от арбитър или вещо лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (094000, 'p', 'O', NULL, 'Посредничество за подкуп');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (094100, 'p', 'O', NULL, 'Провокация за подкуп');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (099950, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ СПОРТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (100000, 'p', 'O', NULL, 'ДОКУМЕНТНИ ПРЕСТЪПЛЕНИЯ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (100100, 'p', 'O', NULL, 'Съставяне и подправка на неистински частен или официален документ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (100200, 'p', 'O', NULL, 'Квалифицирани състави по чл.308 ал.2 и чл.308 ал.3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (100300, 'p', 'O', NULL, 'Съставяне на официален документ с невярно съдържание');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (100400, 'p', 'O', NULL, 'Квалифицирани състави на документни престъпления');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (100500, 'p', 'O', NULL, 'Документни престъпления');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (100600, 'p', 'O', NULL, 'Внасяне на неверни обстоятелства в официален документ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (100700, 'p', 'O', NULL, 'Ползване на неистински или преправен документ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (110000, 'p', 'O', NULL, 'КОМПЮТЪРНИ ПРЕСТЪПЛЕНИЯ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (120000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ РЕДА И ОБЩЕСТВЕНОТО СПОКОЙСТВИЕ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (120100, 'p', 'O', NULL, 'Подбудителство и закана за извършване на престъпление');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (120200, 'p', 'O', NULL, 'Образуване и ръководене на организирана престъпна група');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (120300, 'p', 'O', NULL, 'Участие в ръководството на престъпна организация или група');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (120400, 'p', 'O', NULL, 'Самоуправство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (120500, 'p', 'O', NULL, 'Упражняване на професия без правоспособност');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (120600, 'p', 'O', NULL, 'Хулиганство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (120700, 'p', 'O', NULL, 'Квалифицирани състави на хулиганство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (120800, 'p', 'O', NULL, 'Организиране на боеве с животни или предоставяне на животни за боеве');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (120900, 'p', 'O', NULL, 'Изтезаване на гръбначно животно, довело до смърт, тежко или трайно увреждане');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (121000, 'p', 'O', NULL, 'Неполагане на грижи за гръбначно животно');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (121100, 'p', 'O', NULL, 'Предаване на неверни знаци чрез средства за съобщения');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (121200, 'p', 'O', NULL, 'Хазарт');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (121300, 'p', 'O', NULL, 'Получаване на нетрудови доходи по непозволен или неморален начин');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (130000, 'p', 'O', NULL, 'ОБЩООПАСНИ ПРЕСТЪПЛЕНИЯ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (130100, 'p', 'O', NULL, 'Умишлен палеж');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (130200, 'p', 'O', NULL, 'Квалифицирани състави на палеж и взрив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (130300, 'p', 'O', NULL, 'Палеж по непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (130400, 'p', 'O', NULL, 'Умишлено причиняване на наводнение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (130500, 'p', 'O', NULL, 'Причиняване на наводнение по непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (130600, 'p', 'O', NULL, 'Незаконно производство, придобиване, държане и предаване на оръжие, боеприпаси и взривове');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (130700, 'p', 'O', NULL, 'Производство, използване, продажба или държане на специално техническо средство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (130800, 'p', 'O', NULL, 'Производство и сделки със стоки с двойна употреба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (130900, 'p', 'O', NULL, 'Престъпления в транспорта');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (131000, 'p', 'O', NULL, 'Въздушен тероризъм');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (131100, 'p', 'O', NULL, 'Причиняване на смърт и телесна повреда в транспорта');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (131200, 'p', 'O', NULL, 'Причиняване на телесни повреди и щети в транспорта');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (131300, 'p', 'O', NULL, 'Причиняване на смърт по непредпазливост в транспорта');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (131400, 'p', 'O', NULL, 'Причиняване на телесна повреда при управление на МПС в квалифицирани случаи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (131500, 'p', 'O', NULL, 'Причиняване на смърт при управление на МПС в квалифицирани случаи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (131600, 'p', 'O', NULL, 'Привилегирован състав на транспортно престъпление');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (131700, 'p', 'O', NULL, 'Управление на МПС в пияно състояние или след употреба на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (131800, 'p', 'O', NULL, 'Управление на МПС в срока на изтърпяване на наказание лишаване от право на управление на МПС, след като деецът е наказан за същото деяние по административен ред');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (131900, 'p', 'O', NULL, 'Подправка и използване на контролни знаци и идетификационни номера');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (132000, 'p', 'O', NULL, 'Престъпления против радиосредства и далекосъобщения');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (132100, 'p', 'O', NULL, 'Противозаконно отнемане на МПС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (132200, 'p', 'O', NULL, 'Умишлено замърсяване или заразяване на питейни системи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (132300, 'p', 'O', NULL, 'Квалифицирани състави на умишлено заразяване на птейни системи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (132400, 'p', 'O', NULL, 'Умишлено разпространяване на причинители на епидемично заболяване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (132500, 'p', 'O', NULL, 'Престъпления против народното здраве - чл.349а, чл.350, ал.1, чл.350а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (132600, 'p', 'O', NULL, 'Престъпления против народното здраве - чл.350, ал.2 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (132700, 'p', 'O', NULL, 'Изготвяне на замърсени или заразени храни или питиета с последвала средна, тежка телесна повреда или смърт');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (132800, 'p', 'O', NULL, 'Непредпазливи престъпления против народното здраве');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (132900, 'p', 'O', NULL, 'Използване на минерална вода без надлежно разрешение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (133000, 'p', 'O', NULL, 'Замърсяване на околната среда с химически, биологически и радиоактивни вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (133100, 'p', 'O', NULL, 'Престъпления против околната среда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (133200, 'p', 'O', NULL, 'Основни състави на производство, пренасяне , изготвяне , търговия и др. на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (133300, 'p', 'O', NULL, 'Състави на придобиване и държане на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (133400, 'p', 'O', NULL, 'Склоняване към употреба на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (133500, 'p', 'O', NULL, 'Основен състав на отглеждане на растения с цел производство на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (133600, 'p', 'O', NULL, 'Квалифицирани състави на отглеждане на растения с цел производство на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (133700, 'p', 'O', NULL, 'Приготовления за престъпления, свързани с наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (133800, 'p', 'O', NULL, 'Общоопасни престъпления, извършени от чужд гражданин');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (133900, 'p', 'O', NULL, 'Престъпления, свързани с използване на атомната енергия за мирни цели');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (134000, 'p', 'O', NULL, 'Престъпления, свързани с използване на атомната енергия за мирни цели - чл.356е-356и НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (140000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ ОТБРАНИТЕЛНАТА СПОСОБНОСТ НА РЕПУБЛИКАТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (140100, 'p', 'O', NULL, 'Разгласяване сведения, представляващи държавна тайна');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (140200, 'p', 'O', NULL, 'Престъпления против носене на военната служба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (150000, 'p', 'O', NULL, 'ВОЕННИ ПРЕСТЪПЛЕНИЯ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (150100, 'p', 'O', NULL, 'Престъпления против подчинеността и военната чест');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (150200, 'p', 'O', NULL, 'Отклонение от военна служба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (150300, 'p', 'O', NULL, 'Военно - длъжностни престъпления');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (150400, 'p', 'O', NULL, 'Престъпления против караулната, постовата, патрулната, вътрешната и граничната служба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (150500, 'p', 'O', NULL, 'Престъпления по чл.396 - чл.405 НК, извършени в бойна обстановка');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (160000, 'p', 'O', NULL, 'ПРЕСТЪПЛЕНИЯ ПРОТИВ МИРА И ЧОВЕЧЕСТВОТО');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (160100, 'p', 'O', NULL, 'Престъпления против мира');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (160200, 'p', 'O', NULL, 'Престъпления против законите и обичаите за водене на война');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (160300, 'p', 'O', NULL, 'Престъпления против човечеството');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (170000, 'p', 'Г', NULL, 'Наказателни дела от частен характер - по тъжба на пострадалия (НПК)');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (171000, 'p', 'Г', NULL, 'Обида и квалифицирана обида');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (172000, 'p', 'Г', NULL, 'Клевета и квалифицирана клевета');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (173000, 'p', 'Г', NULL, 'Лека телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (174000, 'p', 'Г', NULL, 'Лека телесна повреда без разстройство на здравето');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (175000, 'p', 'Г', NULL, 'Закана с убийство или с друго престъпление против личността и имота на другиго');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (200000, 'p', 'I', NULL, 'ЧАСТНИ НАКАЗАТЕЛНИ ДЕЛА - СЪДЕБНО ПРОИЗВОДСТВО');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (211000, 'p', 'I', NULL, 'Производство за определяне на общо наказание по чл. 23-27 НК (кумулации – чл. 306, ал. 1, т. 1 НПК)');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (212000, 'p', 'I', NULL, 'Производство за прилагане на чл. 68-69а НК – чл. 306, ал. 1, т. 3 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (213000, 'p', 'I', NULL, 'Производство за прилагане на чл. 70 НК – чл. 306, ал. 1, т. 1 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (220000, 'p', 'I', NULL, 'Производство по ЗЕЕЗА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (221000, 'p', 'I', NULL, 'Производство по осъществяване на международна правна помощ по наказателни дела');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (222000, 'p', 'I', NULL, 'Производство по чл. 457 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (223000, 'p', 'I', NULL, 'Производство по чл. 463 и сл. от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (224000, 'p', 'I', NULL, 'Други производства по Глава 36 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (230000, 'p', 'I', NULL, 'Производство по изпълнение на наказанията (чл. 437 от НПК, чл. 447-452 от НПК)');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (231000, 'p', 'I', NULL, 'Производство по чл. 451 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (232000, 'p', 'I', NULL, 'Производство по чл. 74, ал. 2 от ЗИНЗС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (233000, 'p', 'I', NULL, 'Производство по чл. 111 от ЗИНЗС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (234000, 'p', 'I', NULL, 'Производство по чл. 64, ал. 1 и ал. 2 от ЗИНЗС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (240000, 'p', 'I', NULL, 'Производство по молби за реабилитация');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (241000, 'p', 'I', NULL, 'Производство по предложение за принудителни медицински мерки по чл. 89 от НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (242000, 'p', 'I', NULL, 'Производство по искания за задължително настаняване и лечение по чл. 154,ал. 2 и 3 и по чл. 157 от Закона за здравето');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (243000, 'p', 'I', NULL, 'Производство по делегация на български и чуждестранни съдилища по наказателни дела');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (250000, 'p', 'I', NULL, 'Производство по чл.24 от ЗБППМН');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (251000, 'p', 'I', NULL, 'Производство по чл.24а от ЗБППМН');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (252000, 'p', 'I', NULL, 'Други частни наказателни дела');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (253000, 'p', 'I', NULL, 'Производство по искане на прокурор за разкриване на банкова тайна');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (254000, 'p', 'I', NULL, 'Производство по искания към съда по ЗЕС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (255000, 'p', 'I', NULL, 'Производство по чл. 40, ал. 4 от ДОПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (256000, 'p', 'I', NULL, 'Производство по искания по ЗПИИРКОРНФС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (257000, 'p', 'I', NULL, 'Производство по искания по ЗПИПАОИД');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (258000, 'p', 'I', NULL, 'Производство по искания по ЗПИИСРРПОУАС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (259000, 'p', 'I', NULL, 'Производство по искания по ЗПИИАНМППРМИЗ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (300000, 'p', 'I', NULL, 'ЧАСТНИ НАКАЗАТЕЛНИ ДЕЛА - ПО ВСИЧКИ ИСКАНИЯ КЪМ СЪДА В ДОСЪДЕБНОТО ПРОИЗВОДСТВО');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (301000, 'p', 'I', NULL, 'Производство по чл. 64 НПК - задържане под стража в досъдебното производство и в производството по ЗЕЕЗА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (302000, 'p', 'I', NULL, 'Производство по чл. 65 НПК - задържане под стража в досъдебното производство и в производството по ЗЕЕЗА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (303000, 'p', 'I', NULL, 'Разпит пред съдия в досъдебното производство – чл. 222, чл. 223 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (304000, 'p', 'I', NULL, 'Производство по чл. 243 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (305000, 'p', 'I', NULL, 'Производство по чл. 244 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (306000, 'p', 'I', NULL, 'Производство по чл. 146, чл. 158, чл. 161, чл. 164, чл. 165 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (306100, 'p', 'I', NULL, 'Производство по чл. 68 ЗМВР');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (307000, 'p', 'I', NULL, 'Производство по чл. 61, ал. 3 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (308000, 'p', 'I', NULL, 'Производство по чл. 67 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (309000, 'p', 'I', NULL, 'Производство по чл. 68 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (310000, 'p', 'I', NULL, 'Производство по чл. 69 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (311000, 'p', 'I', NULL, 'Производство по чл. 70 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (312000, 'p', 'I', NULL, 'Производство по чл. 72 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (313000, 'p', 'I', NULL, 'Производство по чл. 73  и чл. 73а НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (314000, 'p', 'I', NULL, 'Производство по Глава 26 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (314100, 'p', 'I', NULL, 'Производство по искания към съда по ЗСРС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (314200, 'p', 'I', NULL, 'Прозиводство по Глава 29 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (315000, 'p', 'I', NULL, 'Други частни наказателни дела по искания към съда в досъдебното производство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (400000, 'p', 'D', NULL, 'АДМИНИСТРАТИВНИ ДЕЛА ОТ НАКАЗАТЕЛЕН ХАРАКТЕР');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (435000, 'p', 'D', NULL, 'Производства по приложението на чл.78а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (438000, 'p', 'D', NULL, 'Други административни от наказателен характер дела');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (438100, 'p', 'D', NULL, 'Производства по чл. 83а от ЗАНН');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (439000, 'p', NULL, 'U', 'КНАХД');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5000000, 'p', NULL, 'W', 'ВЪЗЗИВНИ ПРОИЗВОДСТВА ОТ ОБЩ ХАРАКТЕР');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5010000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ РЕПУБЛИКАТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5010100, 'p', NULL, 'W', 'Измяна');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5010200, 'p', NULL, 'W', 'Предателство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5010300, 'p', NULL, 'W', 'Убийство или телесна повреда на представител на чужда държава с противодържавна цел');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5010400, 'p', NULL, 'W', 'Участие във военни действия на страната на неприятелска държава');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5010500, 'p', NULL, 'W', 'Поставяне в услуга на чужда държава');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5010600, 'p', NULL, 'W', 'Умишлено увреждане на отбранителната способност чрез бунт в армията');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5010700, 'p', NULL, 'W', 'Изпълнение на държавна служба във вреда на републиката');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5010800, 'p', NULL, 'W', 'Приготовление за шпионство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5010900, 'p', NULL, 'W', 'Шпионство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5011000, 'p', NULL, 'W', 'Диверсия');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5011100, 'p', NULL, 'W', 'Вредителство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5011200, 'p', NULL, 'W', 'Престъпления по чл.108 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5011300, 'p', NULL, 'W', 'Тероризъм');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5011400, 'p', NULL, 'W', 'Образуване или ръководене на организация или група');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5020000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ ЛИЧНОСТТА - Убийства');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5020100, 'p', NULL, 'W', 'Убийство по чл.115 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5020200, 'p', NULL, 'W', 'Квалифицирани състави на убийство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5020300, 'p', NULL, 'W', 'Убийство на съдия, прокурор,следовател, полицейски орган, разследващ полицай, държавен или частен съдебен изпълнител и помощник - частен съдебен изпълнител, митнически и данъчен служител');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5020400, 'p', NULL, 'W', 'Приготовление за убийство по чл.115 чл.116 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5020500, 'p', NULL, 'W', 'Убийство в състояние на силно раздразнение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5020600, 'p', NULL, 'W', 'Убийство при превишаване пределите на неизбежната отбрана');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5020700, 'p', NULL, 'W', 'Убиийство от майка на рожба и убийство на новородено с чудовищен вид');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5020800, 'p', NULL, 'W', 'Убийство по непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5020900, 'p', NULL, 'W', 'Убийство по непредпазливост с огнестрелно оръжие, отровно вещество или две или повече лица');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5021000, 'p', NULL, 'W', 'Лишаване от живот при професионална непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5021100, 'p', NULL, 'W', 'Непредпазливо убийство вследствие на умишлено нанесена телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5021200, 'p', NULL, 'W', 'Криминален аборт');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5021300, 'p', NULL, 'W', 'Подпомагане или склоняване към самоубийство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5021400, 'p', NULL, 'W', 'Опит за убийство по чл.115 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5021500, 'p', NULL, 'W', 'Опит за убийство по чл.116 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5021600, 'p', NULL, 'W', 'Опит за убийство по чл.118 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5030000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ ЛИЧНОСТТА - Телесни повреди');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5030100, 'p', NULL, 'W', 'Тежка телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5030200, 'p', NULL, 'W', 'Средна телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5030300, 'p', NULL, 'W', 'Лека телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5030400, 'p', NULL, 'W', 'Лека телесна повреда без разстройство на здравето');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5030500, 'p', NULL, 'W', 'Квалифицирани състави на телесна повреда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5030600, 'p', NULL, 'W', 'Тежка, средна телесна повреда на съдия, прокурор,следовател, лице от състава на МВ, държавен или частен съдебен изпълнител и помощник - частен съдебен изпълнител, митнически и данъчен служител');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5030700, 'p', NULL, 'W', 'Лека телесна повреда на съдия, прокурор,следовател, лице от състава на МВ, държавен или частен съдебен изпълнител и помощник - частен съдебен изпълнител, митнически и данъчен служител');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5030800, 'p', NULL, 'W', 'Тежка или средна телесна повреда, представляваща опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5030900, 'p', NULL, 'W', 'Телесна повреда, причинена в състояние на силно раздразнение и превишаване пределите на неизбежната отбрана');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5031000, 'p', NULL, 'W', 'Тежка или средна телесна повреда, причинена по непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5031100, 'p', NULL, 'W', 'Тежка или средна повреда, причинена при професионална непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5031200, 'p', NULL, 'W', 'Заразяване с венерическа болест');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5040000, 'p', NULL, 'W', 'ДРУГИ ПРЕСТЪПЛЕНИЯ ПРОТИВ ЛИЧНОСТТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5040100, 'p', NULL, 'W', 'Излагане на опасност живота или здравето на трудещите се');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5040200, 'p', NULL, 'W', 'Излагане на опасност живота на другиго');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5040300, 'p', NULL, 'W', 'Неоказване помощ на лице, намиращо се в безпомощно състояние');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5040400, 'p', NULL, 'W', 'Неоказване на помощ при опасност за живота на друго лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5040500, 'p', NULL, 'W', 'Неоказване на помощ при ПТП');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5040600, 'p', NULL, 'W', 'Бездействие на медицинско лице спрямо болен или родилка');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5040700, 'p', NULL, 'W', 'Отвличане');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5040800, 'p', NULL, 'W', 'Квалифицирани състави на отвличане');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5040900, 'p', NULL, 'W', 'Отвличане по чл. 142, ал.3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5041000, 'p', NULL, 'W', 'Приготовление за отвличане');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5041100, 'p', NULL, 'W', 'Противозаконно лишаване от свобода');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5041200, 'p', NULL, 'W', 'Противозаконно лишаване от свобода от длъжностно лице, представител на обществеността в нарушение на службата или функцията му, от охранител, застраховател или лице от състава на МВР, от лице, действащо по поръчение на организирана престъпна група');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5041300, 'p', NULL, 'W', 'Противозаконно лишаване от свобода на бременна жена, малолетно или непълнолетно лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5041400, 'p', NULL, 'W', 'Противозаконно лишаване от свобода по начин, мъчителен и опасен за здравето на пострадалия или продължило повече от две денонощия');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5041500, 'p', NULL, 'W', 'Съзнателно настаняване или задържане на здраво лице в болнично заведение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5041600, 'p', NULL, 'W', 'Принуда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5041700, 'p', NULL, 'W', 'Принуда по чл. 143 ал. 3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5041800, 'p', NULL, 'W', 'Задържане на заложници');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5041900, 'p', NULL, 'W', 'Закана с убийство или с друго престъпление против личността и имота на другиго');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5042000, 'p', NULL, 'W', 'Издаване на чужда тайна');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5042100, 'p', NULL, 'W', 'Издаване на чужда тайна чрез СРС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5042200, 'p', NULL, 'W', 'Обида и квалифицирана обида');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5042300, 'p', NULL, 'W', 'Клевета и квалифицирана клевета');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5042400, 'p', NULL, 'W', 'Блудство с лице, ненавършило 14 г.');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5042500, 'p', NULL, 'W', 'Квалфицирани състави на блудство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5042600, 'p', NULL, 'W', 'Блудство с лице, навършило 14 г.');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5042700, 'p', NULL, 'W', 'Съвкупление с лице, ненавършило 14г. или с лице, навършило 14 г., неразбиращо свойството и значението на извършеното');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5042800, 'p', NULL, 'W', 'Изнасилване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5042900, 'p', NULL, 'W', 'Квалифицирани състави на изнасилване - чл.152 ал.2 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5043000, 'p', NULL, 'W', 'Квалифицирани състави на изнасилване - чл.152 ал.3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5043100, 'p', NULL, 'W', 'Квалифицирани състави на изнасилване - чл.152 ал.4 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5043200, 'p', NULL, 'W', 'Съвкупление чрез използване на служебна или материална зависимост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5043300, 'p', NULL, 'W', 'Съвкупление между възходящи и низходящи, братя и сестри, осиновители и осиновени');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5043400, 'p', NULL, 'W', 'Развратни действия с непълнолетно проституиращо лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5043500, 'p', NULL, 'W', 'Склоняване към проституция');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5043600, 'p', NULL, 'W', 'Извършване на развратни действия чрез изнудване с използване на интернет информация');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5043700, 'p', NULL, 'W', 'Склоняване на непълнолетен за участие или наблюдение на развратни действия');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5043800, 'p', NULL, 'W', 'Отвличане с цел предоставяне за развратни действия');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5043900, 'p', NULL, 'W', 'Квалифицирани състави на отвличане с цел предоставяне за развратни действия - чл.156 ал.2 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5044000, 'p', NULL, 'W', 'Квалифицирани състави на отвличане с цел предоставяне за развратни действия - чл.156 ал.3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5044100, 'p', NULL, 'W', 'Хомосексуални действия, осъществени чрез принуда или използване положение на зависимост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5044200, 'p', NULL, 'W', 'Развратни действия с непълнолетни');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5044300, 'p', NULL, 'W', 'Разпространение на порнографски материали');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5044400, 'p', NULL, 'W', 'Трафик на хора - чл.159а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5044500, 'p', NULL, 'W', 'Трафик на хора - чл.159б НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5044600, 'p', NULL, 'W', 'Използване на лице, пострадало от трафик на хора');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5044700, 'p', NULL, 'W', 'Трафик на хора, представляващ опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5050000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ ПРАВАТА НА ГРАЖДАНИТЕ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5050100, 'p', NULL, 'W', 'Против националното и расовото равенство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5050200, 'p', NULL, 'W', 'Против изповеданията');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5050300, 'p', NULL, 'W', 'Против политическите права на гражданите');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5050400, 'p', NULL, 'W', 'Нарушаване неприкосновеността на жилището и кореспонденцията');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5050500, 'p', NULL, 'W', 'Престъпления против трудовите права на гражданите');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5050600, 'p', NULL, 'W', 'Престъпление против авторските права');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5050700, 'p', NULL, 'W', 'Престъпления против интелектуалната собственост - чл.172б НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5050800, 'p', NULL, 'W', 'Плагиатство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5050900, 'p', NULL, 'W', 'Престъпления против интелектуалната собственост - чл.174 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5051000, 'p', NULL, 'W', 'Престъпления против свободата на събранията, митингите и манифестациите');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5060000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ БРАКА, СЕМЕЙСТВОТО И МЛАДЕЖТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5060100, 'p', NULL, 'W', 'Престъпления против брака и семейството');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5060200, 'p', NULL, 'W', 'Изоставяне на дете по користни подбуди или принуда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5060300, 'p', NULL, 'W', 'Съгласие за продажба на дете');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5060400, 'p', NULL, 'W', 'Неплащане на издръжка');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5060500, 'p', NULL, 'W', 'Престъпления против децата');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5060600, 'p', NULL, 'W', 'Престъпления против младежта');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5060700, 'p', NULL, 'W', 'Упиване с алкохолни напитки на непълнолетни');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5070000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ СОБСТВЕНОСТТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5070100, 'p', NULL, 'W', 'Кражба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5070200, 'p', NULL, 'W', 'Квалифицирани състави на кражба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5070300, 'p', NULL, 'W', 'Кражба в големи размери');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5070400, 'p', NULL, 'W', 'Кражба на взривни вещества,огнестрелни оръжия или боеприпаси от структурните звена на МВР, МО, от Българската армия, от структурите на подчинение на министъра на отбраната и от Държавна агенция Държавен резерв и военновременни запаси');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5070500, 'p', NULL, 'W', 'Кражба, представляваща опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5070600, 'p', NULL, 'W', 'Кражба в особено големи размери, представляваща особено тежък случай');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5070700, 'p', NULL, 'W', 'Привилегирован състав на кражба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5070800, 'p', NULL, 'W', 'Грабеж');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5070900, 'p', NULL, 'W', 'Квалифицирани състави на грабеж - чл.199 ал.1 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5071000, 'p', NULL, 'W', 'Квалифицирани състави на грабеж - чл.199 ал.2 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5071100, 'p', NULL, 'W', 'Приготовление за грабеж');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5071200, 'p', NULL, 'W', 'Длъжностно присвояване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5071300, 'p', NULL, 'W', 'Длъжностно присвояване, за улесняването на което е извършено и друго престъпление, не по- тежко наказуемо');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5071400, 'p', NULL, 'W', 'Длъжностно присвояване в големи размери');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5071500, 'p', NULL, 'W', 'Длъжностно присвояване в особено големи размери, представляващо особено тежък случай');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5071600, 'p', NULL, 'W', 'Маловажни случаи на длъжностно присвояване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5071700, 'p', NULL, 'W', 'Привилегирован състав на длъжностно присвояване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5071800, 'p', NULL, 'W', 'Обсебване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5071900, 'p', NULL, 'W', 'Обсебване в големи размери или представляващо опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5072000, 'p', NULL, 'W', 'Обсебване в особено големи размери, представляващо особено тежък случай');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5072100, 'p', NULL, 'W', 'Присвояване на намерена или случайно попаднала у дееца вещ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5072200, 'p', NULL, 'W', 'Присвояване на съкровище');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5072300, 'p', NULL, 'W', 'Измама');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5072400, 'p', NULL, 'W', 'Квалифицирани състави на измама');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5072500, 'p', NULL, 'W', 'Измама по чл. 209 ал. 1 и 2 и чл. 210 в особено големи размери, особено тежък случай или опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5072600, 'p', NULL, 'W', 'Документна измама');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5072700, 'p', NULL, 'W', 'Документна измама, при която полученото без правно основание имущество е от фондове на Европейския съюз или предоставено от тях на българската държава');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5072800, 'p', NULL, 'W', 'Документна измама в големи размери или представляваща опасен рецидив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5072900, 'p', NULL, 'W', 'Документна измама в особено големи размери');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5073000, 'p', NULL, 'W', 'Измама по чл.212а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5073100, 'p', NULL, 'W', 'Привилегирован състав на измама');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5073200, 'p', NULL, 'W', 'Застрахователна измама');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5073300, 'p', NULL, 'W', 'Рекет');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5073400, 'p', NULL, 'W', 'Квалифицирани състави на рекет - чл.213а, ал.2 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5073500, 'p', NULL, 'W', 'Квалифицирани състави на рекет - чл.213а, ал.3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5073600, 'p', NULL, 'W', 'Квалифицирани състави на рекет - чл.213а, ал.4 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5073700, 'p', NULL, 'W', 'Изнудване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5073800, 'p', NULL, 'W', 'Квалифицирани състави на изнудване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5073900, 'p', NULL, 'W', 'Вещно укривателство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5074000, 'p', NULL, 'W', 'Унищожаване и повреждане');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5074100, 'p', NULL, 'W', 'Злоупотреба на доверие');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5080000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ СТОПАНСТВОТО');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5080100, 'p', NULL, 'W', 'Безстопанственост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5080200, 'p', NULL, 'W', 'Умишлена безстопанственост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5080300, 'p', NULL, 'W', 'Безстопанственост в особено големи размери, представляваща особено тежък случай');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5080400, 'p', NULL, 'W', 'Сключване на неизгодна сделка по в това число и квалифициран състав');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5080500, 'p', NULL, 'W', 'Извършване на строителство върху земеделска земя');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5080600, 'p', NULL, 'W', 'Даване на неверни данни за извършената работа');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5080700, 'p', NULL, 'W', 'Промишлен шпионаж');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5080800, 'p', NULL, 'W', 'Сделки по цени над определените');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5080900, 'p', NULL, 'W', 'Получаване на неследващи се имотни облаги');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5081000, 'p', NULL, 'W', 'Частна стопанска дейност под прикритието на държавна или обществена организация. Наемане на работа на незаконно пребиваващ на територията на РБ чужденец.');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5081100, 'p', NULL, 'W', 'Престъпления против кредиторите');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5081200, 'p', NULL, 'W', 'Престъпления против промишлеността');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5081300, 'p', NULL, 'W', 'Престъпления против търговията');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5081400, 'p', NULL, 'W', 'Продажба и държане на акцизни стоки без бандерол');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5081500, 'p', NULL, 'W', 'Извършване на търговска дейност без разрешение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5081600, 'p', NULL, 'W', 'Неправомерно присъедняване към електропреносна и други мрежи или системи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5081700, 'p', NULL, 'W', 'Престъпления против горското стопанство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5081800, 'p', NULL, 'W', 'Престъпления против ловното и рибното стопанство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5081900, 'p', NULL, 'W', 'Контрабанда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5082000, 'p', NULL, 'W', 'Контрабанда по чл. 242, ал.1, б. а, б, в, д, е, ж, з НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5082100, 'p', NULL, 'W', 'Контрабанда на оръжие, взривове и боеприпаси');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5082200, 'p', NULL, 'W', 'Контрабанда на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5082300, 'p', NULL, 'W', 'Контрабанда на прекурсори или съоръжения и материали за производство на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5082400, 'p', NULL, 'W', 'Квалифицирани състави на контрабанда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5082500, 'p', NULL, 'W', 'Контрабанда на стоки за транзитен пренос');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5082600, 'p', NULL, 'W', 'Престъпления против паричната и кредитна система');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5082700, 'p', NULL, 'W', 'Придобиване или прокарване в обръщение на подправени парични знаци или платежни инструменти');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5082800, 'p', NULL, 'W', 'Престъпление по чл. 244а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5082900, 'p', NULL, 'W', 'Приемане и прокарване на подправен паричен знак');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083000, 'p', NULL, 'W', 'Получаване на кредит чрез представяне на неверни сведения');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083100, 'p', NULL, 'W', 'Използване на платежен инструмент с неверни данни или без съгласието на титуляра');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083200, 'p', NULL, 'W', 'Нарушения на валутния режим - чл.250 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083300, 'p', NULL, 'W', 'Нарушения на валутния режим - чл.251 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083400, 'p', NULL, 'W', 'Извършване по занятие на банкови, застрахователни и други финансови сделки без съответно разрешение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083450, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ СРЕЩУ ДАНЪЧНАТА, ФИНАНСОВАТА И ОСИГУРИТЕЛНА СИСТЕМИ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083500, 'p', NULL, 'W', 'Пране на пари, приготовление и сдружаване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083600, 'p', NULL, 'W', 'Квалифицирани състави на пране на пари');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083700, 'p', NULL, 'W', 'Нарушаване разпоредбите на Закона за мерките срещу изпирането на пари от длъжностно лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083800, 'p', NULL, 'W', 'Престъпления, свързани с нарушаване на бюджетната дисциплина');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5083900, 'p', NULL, 'W', 'Укриване и неплащане на данъчни задължения, вноски за ДОО и здравно осигуряване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5084000, 'p', NULL, 'W', 'Противозаконно противодействие на данъчен орган');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5084100, 'p', NULL, 'W', 'Създаване на юридическо лице с идеална цел с цел получаване на неследваща се имотна облага');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5084200, 'p', NULL, 'W', 'Представяне на невярно заключение от лицензиран оценител или одитор');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5090000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ ДЕЙНОСТТА НА ДЪРЖАВНИТЕ ОРГАНИ И ОБЩЕСТВЕНИТЕ ОРГАНИЗАЦИИ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5090100, 'p', NULL, 'W', 'Престъпления против реда на управлението');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5090200, 'p', NULL, 'W', 'Престъпление относно нарушаване мярките за административен надзор');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5090300, 'p', NULL, 'W', 'Самоволно извършване на действия по служба, която деецът не заема');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5090400, 'p', NULL, 'W', 'Неправомерно държане или ползване на формено облекло или служебни знаци');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5090500, 'p', NULL, 'W', 'Подправяне, разпространение, ползване и унищожаване на официални удостоверителни знаци');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5090600, 'p', NULL, 'W', 'Противоправно търсене и извършване на теренни археологически разкопки или подводни проучвания');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5090700, 'p', NULL, 'W', 'Откриване и несъобщаване, унищожаване или повреждане на културна ценност');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5090800, 'p', NULL, 'W', 'Извършване на археологически разкопки и отчуждаване на културни ценности');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5090900, 'p', NULL, 'W', 'Унищожаване или повреждане на защитени територии, растителни или животински видове');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5091000, 'p', NULL, 'W', 'Незаконно преминаване през граница');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5091100, 'p', NULL, 'W', 'Незаконно превеждане през граница');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5091200, 'p', NULL, 'W', 'Противозаконно подпомагане н чужденец да пребивава в страната в нарушение на закона');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5091300, 'p', NULL, 'W', 'Основен състав на престъпление по служба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5091400, 'p', NULL, 'W', 'Квалифицирани състави на престъпление по служба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5091500, 'p', NULL, 'W', 'Престъпление по служба - чл.282а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5091600, 'p', NULL, 'W', 'Престъпление по служба - чл.283 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5091700, 'p', NULL, 'W', 'Престъпление по служба - чл.283а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5091800, 'p', NULL, 'W', 'Престъпление по служба - чл.283б НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5091900, 'p', NULL, 'W', 'Престъпление по служба - чл.284 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5092000, 'p', NULL, 'W', 'Престъпление по служба - чл.284а - чл.284в НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5092100, 'p', NULL, 'W', 'Престъпление по служба - чл.285 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5092200, 'p', NULL, 'W', 'Набедяване в престъпление пред орган на власт');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5092300, 'p', NULL, 'W', 'Упражняване принуда спрямо обвиняем, свидетел или експерт и манипулиране на технически записи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5092400, 'p', NULL, 'W', 'Престъпление против правосъдието');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5092500, 'p', NULL, 'W', 'Лъжесвидетелстване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5092600, 'p', NULL, 'W', 'Изготвяне и представяне на невярно заключение от вещо лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5092700, 'p', NULL, 'W', 'Подбуждане към престъпление по чл. 290 - 291 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5092800, 'p', NULL, 'W', 'Умишлено неизпълнение на парично задължение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5092900, 'p', NULL, 'W', 'Лично укривателство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5093000, 'p', NULL, 'W', 'Неизпълнение на съдебно решение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5093100, 'p', NULL, 'W', 'Бягство на затворник');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5093200, 'p', NULL, 'W', 'Подкуп');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5093300, 'p', NULL, 'W', 'Квалифицирани състави на подуп');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5093400, 'p', NULL, 'W', 'Подкуп в особено големи размери, представляващ особено тежък случай');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5093500, 'p', NULL, 'W', 'Подкуп на длъжностно лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5093600, 'p', NULL, 'W', 'Подкуп на длъжностно лице, заемащо отговорно служебно положение, включително съдия, съдебен заседател, прокурор или следовател');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5093700, 'p', NULL, 'W', 'Подкуп от и на чуждо длъжностно лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5093800, 'p', NULL, 'W', 'Подкуп с цел упражняване на влияние');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5093900, 'p', NULL, 'W', 'Подкуп, получен от арбитър или вещо лице');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5094000, 'p', NULL, 'W', 'Посредничество за подкуп');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5094100, 'p', NULL, 'W', 'Провокация за подкуп');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5099950, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ СПОРТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5100000, 'p', NULL, 'W', 'ДОКУМЕНТНИ ПРЕСТЪПЛЕНИЯ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5100100, 'p', NULL, 'W', 'Съставяне и подправка на неистински частен или официален документ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5100200, 'p', NULL, 'W', 'Квалифицирани състави по чл.308 ал.2 и чл.308 ал.3 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5100300, 'p', NULL, 'W', 'Съставяне на официален документ с невярно съдържание');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5100400, 'p', NULL, 'W', 'Квалифицирани състави на документни престъпления');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5100500, 'p', NULL, 'W', 'Документни престъпления');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5100600, 'p', NULL, 'W', 'Внасяне на неверни обстоятелства в официален документ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5100700, 'p', NULL, 'W', 'Ползване на неистински или преправен документ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5110000, 'p', NULL, 'W', 'КОМПЮТЪРНИ ПРЕСТЪПЛЕНИЯ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5120000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ РЕДА И ОБЩЕСТВЕНОТО СПОКОЙСТВИЕ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5120100, 'p', NULL, 'W', 'Подбудителство и закана за извършване на престъпление');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5120200, 'p', NULL, 'W', 'Образуване и ръководене на организирана престъпна група');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5120300, 'p', NULL, 'W', 'Участие в ръководството на престъпна организация или група');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5120400, 'p', NULL, 'W', 'Самоуправство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5120500, 'p', NULL, 'W', 'Упражняване на професия без правоспособност');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5120600, 'p', NULL, 'W', 'Хулиганство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5120700, 'p', NULL, 'W', 'Квалифицирани състави на хулиганство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5120800, 'p', NULL, 'W', 'Организиране на боеве с животни или предоставяне на животни за боеве');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5120900, 'p', NULL, 'W', 'Изтезаване на гръбначно животно, довело до смърт, тежко или трайно увреждане');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5121000, 'p', NULL, 'W', 'Неполагане на грижи за гръбначно животно');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5121100, 'p', NULL, 'W', 'Предаване на неверни знаци чрез средства за съобщения');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5121200, 'p', NULL, 'W', 'Хазарт');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5121300, 'p', NULL, 'W', 'Получаване на нетрудови доходи по непозволен или неморален начин');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5130000, 'p', NULL, 'W', 'ОБЩООПАСНИ ПРЕСТЪПЛЕНИЯ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5130100, 'p', NULL, 'W', 'Умишлен палеж');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5130200, 'p', NULL, 'W', 'Квалифицирани състави на палеж и взрив');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5130300, 'p', NULL, 'W', 'Палеж по непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5130400, 'p', NULL, 'W', 'Умишлено причиняване на наводнение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5130500, 'p', NULL, 'W', 'Причиняване на наводнение по непредпазливост');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5130600, 'p', NULL, 'W', 'Незаконно производство, придобиване, държане и предаване на оръжие, боеприпаси и взривове');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5130700, 'p', NULL, 'W', 'Производство, използване, продажба или държане на специално техническо средство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5130800, 'p', NULL, 'W', 'Производство и сделки със стоки с двойна употреба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5130900, 'p', NULL, 'W', 'Престъпления в транспорта');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5131000, 'p', NULL, 'W', 'Въздушен тероризъм');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5131100, 'p', NULL, 'W', 'Причиняване на смърт и телесна повреда в транспорта');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5131200, 'p', NULL, 'W', 'Причиняване на телесни повреди и щети в транспорта');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5131300, 'p', NULL, 'W', 'Причиняване на смърт по непредпазливост в транспорта');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5131400, 'p', NULL, 'W', 'Причиняване на телесна повреда при управление на МПС в квалифицирани случаи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5131500, 'p', NULL, 'W', 'Причиняване на смърт при управление на МПС в квалифицирани случаи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5131600, 'p', NULL, 'W', 'Привилегирован състав на транспортно престъпление');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5131700, 'p', NULL, 'W', 'Управление на МПС в пияно състояние или след употреба на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5131800, 'p', NULL, 'W', 'Управление на МПС в срока на изтърпяване на наказание лишаване от право на управление на МПС, след като деецът е наказан за същото деяние по административен ред');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5131900, 'p', NULL, 'W', 'Подправка и използване на контролни знаци и идетификационни номера');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5132000, 'p', NULL, 'W', 'Престъпления против радиосредства и далекосъобщения');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5132100, 'p', NULL, 'W', 'Противозаконно отнемане на МПС');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5132200, 'p', NULL, 'W', 'Умишлено замърсяване или заразяване на питейни системи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5132300, 'p', NULL, 'W', 'Квалифицирани състави на умишлено заразяване на птейни системи');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5132400, 'p', NULL, 'W', 'Умишлено разпространяване на причинители на епидемично заболяване');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5132500, 'p', NULL, 'W', 'Престъпления против народното здраве - чл.349а, чл.350, ал.1, чл.350а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5132600, 'p', NULL, 'W', 'Престъпления против народното здраве - чл.350, ал.2 НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5132700, 'p', NULL, 'W', 'Изготвяне на замърсени или заразени храни или питиета с последвала средна, тежка телесна повреда или смърт');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5132800, 'p', NULL, 'W', 'Непредпазливи престъпления против народното здраве');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5132900, 'p', NULL, 'W', 'Използване на минерална вода без надлежно разрешение');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5133000, 'p', NULL, 'W', 'Замърсяване на околната среда с химически, биологически и радиоактивни вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5133100, 'p', NULL, 'W', 'Престъпления против околната среда');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5133200, 'p', NULL, 'W', 'Основни състави на производство, пренасяне , изготвяне , търговия и др. на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5133300, 'p', NULL, 'W', 'Състави на придобиване и държане на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5133400, 'p', NULL, 'W', 'Склоняване към употреба на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5133500, 'p', NULL, 'W', 'Основен състав на отглеждане на растения с цел производство на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5133600, 'p', NULL, 'W', 'Квалифицирани състави на отглеждане на растения с цел производство на наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5133700, 'p', NULL, 'W', 'Приготовления за престъпления, свързани с наркотични вещества');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5133800, 'p', NULL, 'W', 'Общоопасни престъпления, извършени от чужд гражданин');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5133900, 'p', NULL, 'W', 'Престъпления, свързани с използване на атомната енергия за мирни цели');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5134000, 'p', NULL, 'W', 'Престъпления, свързани с използване на атомната енергия за мирни цели - чл.356е-356и НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5140000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ ОТБРАНИТЕЛНАТА СПОСОБНОСТ НА РЕПУБЛИКАТА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5140100, 'p', NULL, 'W', 'Разгласяване сведения, представляващи държавна тайна');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5140200, 'p', NULL, 'W', 'Престъпления против носене на военната служба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5150000, 'p', NULL, 'W', 'ВОЕННИ ПРЕСТЪПЛЕНИЯ');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5150100, 'p', NULL, 'W', 'Престъпления против подчинеността и военната чест');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5150200, 'p', NULL, 'W', 'Отклонение от военна служба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5150300, 'p', NULL, 'W', 'Военно - длъжностни престъпления');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5150400, 'p', NULL, 'W', 'Престъпления против караулната, постовата, патрулната, вътрешната и граничната служба');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5150500, 'p', NULL, 'W', 'Престъпления по чл.396 - чл.405 НК, извършени в бойна обстановка');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5160000, 'p', NULL, 'W', 'ПРЕСТЪПЛЕНИЯ ПРОТИВ МИРА И ЧОВЕЧЕСТВОТО');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5160100, 'p', NULL, 'W', 'Престъпления против мира');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5160200, 'p', NULL, 'W', 'Престъпления против законите и обичаите за водене на война');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (5160300, 'p', NULL, 'W', 'Престъпления против човечеството');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (600000, 'p', NULL, 'C', 'ВЪЗЗИВНИ ПРОИЗВОДСТВА ОТ ЧАСТЕН ХАРАКТЕР');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (700000, 'p', NULL, 'H', 'ВЪЗЗИВНИ ЧАСТНИ НАКАЗАТЕЛНИ ДЕЛА - СЪДЕБНО ПРОИЗВОДСТВО');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (701000, 'p', NULL, 'H', 'Производство за определяне на общо наказание по чл. 23-27 НК (кумулации – чл. 306, ал. 1, т. 1 НПК)');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (702000, 'p', NULL, 'H', 'Производство за прилагане на чл. 53 НК – чл. 306, ал. 1, т. 1 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (703000, 'p', NULL, 'H', 'Производство за определяне на първоначалния режим и типа затворническо заведение – чл. 61, т. 1–3 ЗИНЗС (чл.306, ал. 1, т. 2 НПК)');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (704000, 'p', NULL, 'H', 'Производство за прилагане на чл. 68-69а НК – чл. 306, ал. 1, т. 3 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (705000, 'p', NULL, 'H', 'Производство за прилагане на чл. 70 НК – чл. 306, ал. 1, т. 1 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (706000, 'p', NULL, 'H', 'Производство за произнасяне за веществените доказателства и разноските - чл. 306, ал. 1, т. 4 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (707000, 'p', NULL, 'H', 'Производство по ЗЕЕЗА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (708000, 'p', NULL, 'H', 'Производство по осъществяване на международна правна помощ по наказателни дела');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (709000, 'p', NULL, 'H', 'Производство по чл. 457 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (710000, 'p', NULL, 'H', 'Производство по чл. 463 и сл. от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (711000, 'p', NULL, 'H', 'Други производства по Глава 36 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (712000, 'p', NULL, 'H', 'Производство по изпълнение на наказанията (чл. 447-452 от НПК)');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (713000, 'p', NULL, 'H', 'Производство по чл. 451 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (714000, 'p', NULL, 'H', 'Производство по молби за реабилитация');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (715000, 'p', NULL, 'H', 'Производство по предложение за принудителни медицински мерки по чл. 89 от НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (716000, 'p', NULL, 'H', 'Производство по искания за задължително настаняване и лечение по чл. 154,ал. 2 и 3 и по чл. 157 от Закона за здравето');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (717000, 'p', NULL, 'H', 'Производство по чл. 249 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (718000, 'p', NULL, 'H', 'Производство по чл. 270 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (719000, 'p', NULL, 'H', 'Производство по чл. 309, ал. 2 и 3 от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (720000, 'p', NULL, 'H', 'Производство по чл. 24б от ЗБППМН');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (730000, 'p', NULL, 'H', 'Други въззивни частни наказателни дела, други производства по Глава XXII НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (800000, 'p', NULL, 'H', 'ВЪЗЗИВНИ ЧАСТНИ НАКАЗАТЕЛНИ ДЕЛА - ПО ВСИЧКИ ИСКАНИЯ КЪМ СЪДА В ДОСЪДЕБНОТО ПРОИЗВОДСТВО');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (801000, 'p', NULL, 'H', 'Производство по чл. 64 НПК - задържане под стража в досъдебното производство и в производството по ЗЕЕЗА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (802000, 'p', NULL, 'H', 'Производство по чл. 65 НПК - задържане под стража в досъдебното производство и в производството по ЗЕЕЗА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (803000, 'p', NULL, 'H', 'Производство по чл. 243 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (804000, 'p', NULL, 'H', 'Производство по чл. 68 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (805000, 'p', NULL, 'H', 'Производство по чл. 69 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (806000, 'p', NULL, 'H', 'Производство по чл. 70 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (807000, 'p', NULL, 'H', 'Производство по чл. 72 НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (808000, 'p', NULL, 'H', 'Производство по чл. 73 и чл. 73а от НПК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (809000, 'p', NULL, 'H', 'Други въззивни частни наказателни дела по искания към съда в досъдебното производство');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (9000000, 'p', NULL, 'П', 'ВЪЗЗИВНИ АДМИНИСТРАТИВНО-НАКАЗАТЕЛНИ ДЕЛА');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (9435000, 'p', 'D', 'П', 'Производства по приложението на чл.78а НК');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (9438000, 'p', 'D', 'П', 'Други административни от наказателен характер дела');
INSERT INTO T_SUBJECT (F_SUBJECT, F_TYPE, F_KIND_I, F_KIND_II, F_NAME) VALUES (9438100, 'p', 'D', 'П', 'Производства по чл. 83а от ЗАНН');
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (10000, 10100, 10200, 10300, 10400, 10500, 10600, 10700, 10800, 10900, 11000, 11100, 11200, 11400) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p')
WHERE F_SUBJECT = 11300 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (20000, 20500, 20600, 20700, 20800, 20900, 21100, 21200, 21300, 21400, 21500, 21600, 30000, 30100, 30200, 30300, 30400, 30600, 30700, 30800, 30900, 31000, 31100, 31200, 40000, 40100, 40200, 40300, 40400, 40500, 40600, 41600, 41700, 41800, 42000, 42100, 42200, 42300, 42400, 42500, 42600, 42700, 42800) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (43200, 43300, 43400, 43600, 43700, 44100, 44200, 44300, 44700) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (20100, 20200, 20300) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p')
WHERE F_SUBJECT = 20400 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (21000, 30500) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (40700, 40800, 40900, 41000, 41100, 41300, 41400, 41500, 43800, 43900, 44000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p')
WHERE F_SUBJECT = 41200 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (41900, 42900, 43000, 43100) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p')
WHERE F_SUBJECT = 43500 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (44400, 44500, 44600) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (50000, 50100, 50200, 50300, 50400, 50500, 50600, 50700, 50800, 50900, 51000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (60000, 60100, 60200, 60300, 60400, 60500, 60600, 60700) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (70000, 72300, 72400, 72500, 73200, 73900, 74000, 74100) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (70100, 70200, 70300, 70400, 70500, 70600, 70700) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (70800, 70900, 71000, 71100) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (71200, 71300, 71400, 71500, 71600, 71700, 71800, 71900, 72000, 72100, 72200) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (72600, 72700, 72800, 72900, 73000, 73100) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (73300, 73400, 73500, 73600, 73700, 73800) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (80000, 80100, 80200, 80300, 80400, 80500, 80600, 81000, 81100, 81200, 81300, 81400, 81500, 81600, 81700, 81800, 81900, 82100) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (80700, 80800, 80900) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (82000, 82200, 82300, 82400, 82500) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (82600, 82700, 82800, 82900, 83000, 83100, 83200, 83300, 83400) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (83500, 83800, 84000, 84100, 84200) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p')
WHERE F_SUBJECT = 83600 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p')
WHERE F_SUBJECT = 83700 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p')
WHERE F_SUBJECT = 83900 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (90000, 90100, 90200, 90300, 90400, 90500, 90600, 90700, 90800, 90900, 91000, 91200, 91900, 92000, 92100, 92200, 92300, 92400, 92500, 92600, 92700, 92800, 92900, 93000, 93100) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p')
WHERE F_SUBJECT = 91100 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (91300, 91400, 91500, 91600, 91700, 91800) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (93200, 93300, 93400, 93500, 93600, 93900, 94100) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p')
WHERE F_SUBJECT = 93700 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p')
WHERE F_SUBJECT = 93800 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p')
WHERE F_SUBJECT = 94000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (100000, 100100, 100200, 100300, 100400, 100500, 100600, 100700) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p')
WHERE F_SUBJECT = 110000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (120000, 120100, 120400, 120500, 120600, 120700, 120800, 120900, 121000, 121100, 121200) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (120200, 120300) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (130000, 130100, 130300, 130400, 130500, 130700, 130800, 130900, 131000, 131100, 131200, 131400, 131500, 131600, 131700, 131800, 131900, 132000, 132200, 132300, 132400, 132500, 132600, 132700, 132800, 132900, 133000, 133100, 133900) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p')
WHERE F_SUBJECT = 134000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p')
WHERE F_SUBJECT = 130200 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p')
WHERE F_SUBJECT = 130600 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p')
WHERE F_SUBJECT = 131300 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p')
WHERE F_SUBJECT = 132100 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (133200, 133300, 133400, 133500, 133600, 133700) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p')
WHERE F_SUBJECT = 133800 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (140000, 140200) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p')
WHERE F_SUBJECT = 140100 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (150000, 150100, 150200, 150300, 150400, 150500, 160000, 160100, 160200, 160300, 170000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (200000, 222000, 223000, 224000, 232000, 233000, 241000, 242000, 243000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (250000, 251000, 252000, 253000, 254000, 255000, 256000, 257000, 258000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p')
WHERE F_SUBJECT = 234000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p')
WHERE F_SUBJECT = 211000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p')
WHERE F_SUBJECT = 212000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p')
WHERE F_SUBJECT = 213000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p')
WHERE F_SUBJECT = 220000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p')
WHERE F_SUBJECT = 221000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p')
WHERE F_SUBJECT = 230000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p')
WHERE F_SUBJECT = 231000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p')
WHERE F_SUBJECT = 240000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (300000, 308000, 314000, 314100, 314200, 315000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p')
WHERE F_SUBJECT = 301000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p')
WHERE F_SUBJECT = 302000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p')
WHERE F_SUBJECT = 303000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (304000, 305000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p')
WHERE F_SUBJECT = 306000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p')
WHERE F_SUBJECT = 307000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p')
WHERE F_SUBJECT = 309000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p')
WHERE F_SUBJECT = 310000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p')
WHERE F_SUBJECT = 311000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p')
WHERE F_SUBJECT = 312000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p')
WHERE F_SUBJECT = 313000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (400000, 438000, 438100) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p')
WHERE F_SUBJECT = 439000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p')
WHERE F_SUBJECT = 435000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p')
WHERE F_SUBJECT = 5000000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p')
WHERE F_SUBJECT = 600000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (700000, 701000, 702000, 703000, 704000, 705000, 706000, 707000, 708000, 709000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (710000, 711000, 712000, 713000, 714000, 715000, 716000, 717000, 718000, 719000, 720000, 730000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (800000, 801000, 804000, 805000, 806000, 807000, 808000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p')
WHERE F_SUBJECT = 802000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p')
WHERE F_SUBJECT = 803000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p')
WHERE F_SUBJECT = 809000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p')
WHERE F_SUBJECT = 9000000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (5010000, 5010100, 5010200, 5010300, 5010400, 5010500, 5010600, 5010700, 5010800, 5010900, 5011000, 5011100, 5011200, 5011300, 5011400, 5020000, 5020100, 5020200, 5020300, 5020400, 5020500, 5020600, 5020700, 5020800, 5020900, 5021000, 5021100, 5021200, 5021300, 5021400, 5021500, 5021600, 5030000, 5030100, 5030200, 5030300, 5030400, 5030500, 5030600, 5030700, 5030800, 5030900, 5031000, 5031100, 5031200) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (5040000, 5040100, 5040200, 5040300, 5040400, 5040500, 5040600, 5040700, 5040800, 5040900, 5041000, 5041100, 5041200, 5041300, 5041400, 5041500, 5041600, 5041700, 5041800, 5041900, 5042000, 5042100, 5042200, 5042300, 5042400, 5042500, 5042600, 5042700, 5042800, 5042900, 5043000, 5043100, 5043200, 5043300, 5043400, 5043500, 5043600, 5043700, 5043800, 5043900, 5044000, 5044100, 5044200, 5044300, 5044400, 5044500, 5044600, 5044700, 5050000, 5050100, 5050200, 5050300, 5050400, 5050500, 5050600, 5050700, 5050800, 5050900, 5051000, 5060000, 5060100, 5060200, 5060300, 5060400, 5060500, 5060600, 5060700) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (5070000, 5070100, 5070200, 5070300, 5070400, 5070500, 5070600, 5070700, 5070800, 5070900, 5071000, 5071100, 5071200, 5071300, 5071400, 5071500, 5071600, 5071700, 5071800, 5071900, 5072000, 5072100, 5072200, 5072300, 5072400, 5072500, 5072600, 5072700, 5072800, 5072900, 5073000, 5073100, 5073200, 5073300, 5073400, 5073500, 5073600, 5073700, 5073800, 5073900, 5074000, 5074100, 5080000, 5080100, 5080200, 5080300, 5080400, 5080500, 5080600, 5080700, 5080800, 5080900, 5081000, 5081100, 5081200, 5081300, 5081400, 5081500, 5081600, 5081700, 5081800, 5081900, 5082000, 5082100, 5082200, 5082300, 5082400, 5082500, 5082600, 5082700, 5082800, 5082900, 5083000, 5083100, 5083200, 5083300, 5083400, 5083500, 5083600, 5083700, 5083800, 5083900, 5084000, 5084100, 5084200, 5090000, 5090100, 5090200, 5090300, 5090400, 5090500, 5090600, 5090700, 5090800, 5090900, 5091000, 5091100, 5091200, 5091300, 5091400, 5091500, 5091600, 5091700, 5091800, 5091900, 5092000, 5092100, 5092200, 5092300, 5092400, 5092500, 5092600, 5092700, 5092800, 5092900, 5093000, 5093100, 5093200, 5093300, 5093400, 5093500, 5093600, 5093700, 5093800, 5093900, 5094000, 5094100) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (5100000, 5100100, 5100200, 5100300, 5100400, 5100500, 5100600, 5100700, 5110000, 5120000, 5120100, 5120200, 5120300, 5120400, 5120500, 5120600, 5120700, 5120800, 5120900, 5121000, 5121100, 5121200, 5130000, 5130100, 5130200, 5130300, 5130400, 5130500, 5130600, 5130700, 5130800, 5130900, 5131000, 5131100, 5131200, 5131300, 5131400, 5131500, 5131600, 5131700, 5131800, 5131900, 5132000, 5132100, 5132200, 5132300, 5132400, 5132500, 5132600, 5132700, 5132800, 5132900, 5133000, 5133100, 5133200, 5133300, 5133400, 5133500, 5133600, 5133700, 5133800, 5133900, 5134000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (5140000, 5140100, 5140200, 5150000, 5150100, 5150200, 5150300, 5150400, 5150500, 5160000, 5160100, 5160200, 5160300) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (9435000, 9438000, 9438100) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p')
WHERE F_SUBJECT = 306100 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (171000, 172000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p')
WHERE F_SUBJECT IN (173000, 174000, 175000) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p')
WHERE F_SUBJECT = 259000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p')
WHERE F_SUBJECT = 121300 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p')
WHERE F_SUBJECT = 5121300 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p')
WHERE F_SUBJECT = 83450 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_I = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_ATTRIB_I = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_RESULTS_I = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_CLOSEDS_I = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_PENALITIES_I = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_REASONS_I = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_I = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_QUICK_REPORT_I = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_VID_I = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p')
WHERE F_SUBJECT = 99950 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p')
WHERE F_SUBJECT = 5083450 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET
 F_FLAGS_II = (SELECT F_FLAGS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_ATTRIB_II = (SELECT F_ATTRIB FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_RESULTS_II = (SELECT F_RESULTS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_CLOSEDS_II = (SELECT F_CLOSEDS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_PENALITIES_II = (SELECT F_PENALITIES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_REASONS_II = (SELECT F_REASONS FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_JUDGE_REPORT_II = (SELECT F_JUDGE_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_QUICK_REPORT_II = (SELECT F_QUICK_REPORT FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_VID_II = (SELECT F_VID FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p'),
 F_SBES_II = (SELECT F_SBES FROM T_OLD_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p')
WHERE F_SUBJECT = 5099950 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET F_FLAGS_X = 1 WHERE F_TYPE = 'p' AND F_SUBJECT = 314200;
UPDATE T_SUBJECT SET
 F_VID_I = (SELECT F_VID_I FROM T_SUBJECT WHERE F_SUBJECT = 221000 AND F_TYPE = 'p'),
 F_SBES_I = (SELECT F_SBES_I FROM T_SUBJECT WHERE F_SUBJECT = 221000 AND F_TYPE = 'p')
WHERE F_SUBJECT = 222000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET F_FLAGS_X = 1 WHERE F_SUBJECT IN (030300, 5030300) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET F_FLAGS_X = 1 WHERE F_SUBJECT IN (030400, 5030400) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET F_FLAGS_X = 1 WHERE F_SUBJECT IN (042200, 5042200) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET F_FLAGS_X = 1 WHERE F_SUBJECT IN (042300, 5042300) AND F_TYPE = 'p';
UPDATE T_SUBJECT SET F_FLAGS_X = 1 WHERE F_SUBJECT = 213000 AND F_TYPE = 'p';
UPDATE T_SUBJECT SET F_ATTRIB_I = 'H' || F_ATTRIB_I WHERE F_KIND_I = 'O' AND NOT F_ATTRIB_I LIKE '%H%';
UPDATE T_SUBJECT SET F_CLOSEDS_I = '[' || F_CLOSEDS_I WHERE F_TYPE = 'p' AND F_CLOSEDS_I LIKE '%g%';
UPDATE T_SUBJECT SET F_CLOSEDS_II = '[' || F_CLOSEDS_II WHERE F_TYPE = 'p' AND F_CLOSEDS_II LIKE '%g%';
UPDATE T_SUBJECT SET F_CLOSEDS_I = ']' || F_CLOSEDS_I WHERE NOT F_CLOSEDS_I IS NULL;
UPDATE T_SUBJECT SET F_CLOSEDS_II = ']' || F_CLOSEDS_II WHERE NOT F_CLOSEDS_II IS NULL;
UPDATE T_SUBJECT SET F_VID_I = 1019, F_SBES_I = '880, 904, 906, 910, 930, 932, 948, 15347, 15448'
WHERE F_SUBJECT = 311000 AND F_TYPE = 'p';
SELECT * FROM T_SUBJECT WHERE (F_RESULTS_I IS NULL OR F_CLOSEDS_I IS NULL) AND NOT F_KIND_I IS NULL;
SELECT * FROM T_SUBJECT WHERE (F_RESULTS_II IS NULL OR F_CLOSEDS_II IS NULL) AND NOT F_KIND_II IS NULL;
UPDATE T_SUBJECT SET F_SUBJECT = NULL WHERE F_RESULTS_I IS NULL AND F_RESULTS_II IS NULL;
UPDATE T_SUBJECT SET F_SUBJECT = NULL WHERE F_CLOSEDS_I IS NULL AND F_CLOSEDS_II IS NULL;
INSERT INTO T_COMPOSITION VALUES ('I', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 001);
INSERT INTO T_COMPOSITION VALUES ('II', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 002);
INSERT INTO T_COMPOSITION VALUES ('III', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 003);
INSERT INTO T_COMPOSITION VALUES ('IV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 004);
INSERT INTO T_COMPOSITION VALUES ('V', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 005);
INSERT INTO T_COMPOSITION VALUES ('VI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 006);
INSERT INTO T_COMPOSITION VALUES ('VII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 007);
INSERT INTO T_COMPOSITION VALUES ('VIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 008);
INSERT INTO T_COMPOSITION VALUES ('IX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 009);
INSERT INTO T_COMPOSITION VALUES ('X', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 010);
INSERT INTO T_COMPOSITION VALUES ('XI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 011);
INSERT INTO T_COMPOSITION VALUES ('XII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 012);
INSERT INTO T_COMPOSITION VALUES ('XIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 013);
INSERT INTO T_COMPOSITION VALUES ('XIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 014);
INSERT INTO T_COMPOSITION VALUES ('XV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 015);
INSERT INTO T_COMPOSITION VALUES ('XVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 016);
INSERT INTO T_COMPOSITION VALUES ('XVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 017);
INSERT INTO T_COMPOSITION VALUES ('XVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 018);
INSERT INTO T_COMPOSITION VALUES ('XIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 019);
INSERT INTO T_COMPOSITION VALUES ('XX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 020);
INSERT INTO T_COMPOSITION VALUES ('XXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 021);
INSERT INTO T_COMPOSITION VALUES ('XXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 022);
INSERT INTO T_COMPOSITION VALUES ('XXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 023);
INSERT INTO T_COMPOSITION VALUES ('XXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 024);
INSERT INTO T_COMPOSITION VALUES ('XXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 025);
INSERT INTO T_COMPOSITION VALUES ('XXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 026);
INSERT INTO T_COMPOSITION VALUES ('XXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 027);
INSERT INTO T_COMPOSITION VALUES ('XXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 028);
INSERT INTO T_COMPOSITION VALUES ('XXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 029);
INSERT INTO T_COMPOSITION VALUES ('XXX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 030);
INSERT INTO T_COMPOSITION VALUES ('XXXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 031);
INSERT INTO T_COMPOSITION VALUES ('XXXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 032);
INSERT INTO T_COMPOSITION VALUES ('XXXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 033);
INSERT INTO T_COMPOSITION VALUES ('XXXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 034);
INSERT INTO T_COMPOSITION VALUES ('XXXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 035);
INSERT INTO T_COMPOSITION VALUES ('XXXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 036);
INSERT INTO T_COMPOSITION VALUES ('XXXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 037);
INSERT INTO T_COMPOSITION VALUES ('XXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 038);
INSERT INTO T_COMPOSITION VALUES ('XXXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 039);
INSERT INTO T_COMPOSITION VALUES ('XL', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 040);
INSERT INTO T_COMPOSITION VALUES ('XLI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 041);
INSERT INTO T_COMPOSITION VALUES ('XLII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 042);
INSERT INTO T_COMPOSITION VALUES ('XLIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 043);
INSERT INTO T_COMPOSITION VALUES ('XLIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 044);
INSERT INTO T_COMPOSITION VALUES ('XLV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 045);
INSERT INTO T_COMPOSITION VALUES ('XLVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 046);
INSERT INTO T_COMPOSITION VALUES ('XLVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 047);
INSERT INTO T_COMPOSITION VALUES ('XLVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 048);
INSERT INTO T_COMPOSITION VALUES ('XLIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 049);
INSERT INTO T_COMPOSITION VALUES ('L', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 050);
INSERT INTO T_COMPOSITION VALUES ('LI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 051);
INSERT INTO T_COMPOSITION VALUES ('LII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 052);
INSERT INTO T_COMPOSITION VALUES ('LIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 053);
INSERT INTO T_COMPOSITION VALUES ('LIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 054);
INSERT INTO T_COMPOSITION VALUES ('LV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 055);
INSERT INTO T_COMPOSITION VALUES ('LVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 056);
INSERT INTO T_COMPOSITION VALUES ('LVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 057);
INSERT INTO T_COMPOSITION VALUES ('LVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 058);
INSERT INTO T_COMPOSITION VALUES ('LIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 059);
INSERT INTO T_COMPOSITION VALUES ('LX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 060);
INSERT INTO T_COMPOSITION VALUES ('LXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 061);
INSERT INTO T_COMPOSITION VALUES ('LXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 062);
INSERT INTO T_COMPOSITION VALUES ('LXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 063);
INSERT INTO T_COMPOSITION VALUES ('LXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 064);
INSERT INTO T_COMPOSITION VALUES ('LXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 065);
INSERT INTO T_COMPOSITION VALUES ('LXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 066);
INSERT INTO T_COMPOSITION VALUES ('LXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 067);
INSERT INTO T_COMPOSITION VALUES ('LXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 068);
INSERT INTO T_COMPOSITION VALUES ('LXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 069);
INSERT INTO T_COMPOSITION VALUES ('LXX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 070);
INSERT INTO T_COMPOSITION VALUES ('LXXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 071);
INSERT INTO T_COMPOSITION VALUES ('LXXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 072);
INSERT INTO T_COMPOSITION VALUES ('LXXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 073);
INSERT INTO T_COMPOSITION VALUES ('LXXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 074);
INSERT INTO T_COMPOSITION VALUES ('LXXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 075);
INSERT INTO T_COMPOSITION VALUES ('LXXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 076);
INSERT INTO T_COMPOSITION VALUES ('LXXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 077);
INSERT INTO T_COMPOSITION VALUES ('LXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 078);
INSERT INTO T_COMPOSITION VALUES ('LXXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 079);
INSERT INTO T_COMPOSITION VALUES ('LXXX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 080);
INSERT INTO T_COMPOSITION VALUES ('LXXXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 081);
INSERT INTO T_COMPOSITION VALUES ('LXXXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 082);
INSERT INTO T_COMPOSITION VALUES ('LXXXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 083);
INSERT INTO T_COMPOSITION VALUES ('LXXXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 084);
INSERT INTO T_COMPOSITION VALUES ('LXXXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 085);
INSERT INTO T_COMPOSITION VALUES ('LXXXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 086);
INSERT INTO T_COMPOSITION VALUES ('LXXXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 087);
INSERT INTO T_COMPOSITION VALUES ('LXXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 088);
INSERT INTO T_COMPOSITION VALUES ('LXXXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 089);
INSERT INTO T_COMPOSITION VALUES ('XC', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 090);
INSERT INTO T_COMPOSITION VALUES ('XCI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 091);
INSERT INTO T_COMPOSITION VALUES ('XCII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 092);
INSERT INTO T_COMPOSITION VALUES ('XCIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 093);
INSERT INTO T_COMPOSITION VALUES ('XCIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 094);
INSERT INTO T_COMPOSITION VALUES ('XCV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 095);
INSERT INTO T_COMPOSITION VALUES ('XCVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 096);
INSERT INTO T_COMPOSITION VALUES ('XCVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 097);
INSERT INTO T_COMPOSITION VALUES ('XCVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 098);
INSERT INTO T_COMPOSITION VALUES ('XCIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 099);
INSERT INTO T_COMPOSITION VALUES ('C', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 100);
INSERT INTO T_COMPOSITION VALUES ('CI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 101);
INSERT INTO T_COMPOSITION VALUES ('CII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 102);
INSERT INTO T_COMPOSITION VALUES ('CIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 103);
INSERT INTO T_COMPOSITION VALUES ('CIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 104);
INSERT INTO T_COMPOSITION VALUES ('CV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 105);
INSERT INTO T_COMPOSITION VALUES ('CVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 106);
INSERT INTO T_COMPOSITION VALUES ('CVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 107);
INSERT INTO T_COMPOSITION VALUES ('CVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 108);
INSERT INTO T_COMPOSITION VALUES ('CIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 109);
INSERT INTO T_COMPOSITION VALUES ('CX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 110);
INSERT INTO T_COMPOSITION VALUES ('CXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 111);
INSERT INTO T_COMPOSITION VALUES ('CXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 112);
INSERT INTO T_COMPOSITION VALUES ('CXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 113);
INSERT INTO T_COMPOSITION VALUES ('CXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 114);
INSERT INTO T_COMPOSITION VALUES ('CXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 115);
INSERT INTO T_COMPOSITION VALUES ('CXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 116);
INSERT INTO T_COMPOSITION VALUES ('CXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 117);
INSERT INTO T_COMPOSITION VALUES ('CXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 118);
INSERT INTO T_COMPOSITION VALUES ('CXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 119);
INSERT INTO T_COMPOSITION VALUES ('CXX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 120);
INSERT INTO T_COMPOSITION VALUES ('CXXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 121);
INSERT INTO T_COMPOSITION VALUES ('CXXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 122);
INSERT INTO T_COMPOSITION VALUES ('CXXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 123);
INSERT INTO T_COMPOSITION VALUES ('CXXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 124);
INSERT INTO T_COMPOSITION VALUES ('CXXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 125);
INSERT INTO T_COMPOSITION VALUES ('CXXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 126);
INSERT INTO T_COMPOSITION VALUES ('CXXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 127);
INSERT INTO T_COMPOSITION VALUES ('CXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 128);
INSERT INTO T_COMPOSITION VALUES ('CXXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 129);
INSERT INTO T_COMPOSITION VALUES ('CXXX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 130);
INSERT INTO T_COMPOSITION VALUES ('CXXXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 131);
INSERT INTO T_COMPOSITION VALUES ('CXXXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 132);
INSERT INTO T_COMPOSITION VALUES ('CXXXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 133);
INSERT INTO T_COMPOSITION VALUES ('CXXXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 134);
INSERT INTO T_COMPOSITION VALUES ('CXXXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 135);
INSERT INTO T_COMPOSITION VALUES ('CXXXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 136);
INSERT INTO T_COMPOSITION VALUES ('CXXXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 137);
INSERT INTO T_COMPOSITION VALUES ('CXXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 138);
INSERT INTO T_COMPOSITION VALUES ('CXXXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 139);
INSERT INTO T_COMPOSITION VALUES ('CXL', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 140);
INSERT INTO T_COMPOSITION VALUES ('CXLI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 141);
INSERT INTO T_COMPOSITION VALUES ('CXLII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 142);
INSERT INTO T_COMPOSITION VALUES ('CXLIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 143);
INSERT INTO T_COMPOSITION VALUES ('CXLIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 144);
INSERT INTO T_COMPOSITION VALUES ('CXLV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 145);
INSERT INTO T_COMPOSITION VALUES ('CXLVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 146);
INSERT INTO T_COMPOSITION VALUES ('CXLVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 147);
INSERT INTO T_COMPOSITION VALUES ('CXLVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 148);
INSERT INTO T_COMPOSITION VALUES ('CXLIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 149);
INSERT INTO T_COMPOSITION VALUES ('CL', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 150);
INSERT INTO T_COMPOSITION VALUES ('CLI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 151);
INSERT INTO T_COMPOSITION VALUES ('CLII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 152);
INSERT INTO T_COMPOSITION VALUES ('CLIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 153);
INSERT INTO T_COMPOSITION VALUES ('CLIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 154);
INSERT INTO T_COMPOSITION VALUES ('CLV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 155);
INSERT INTO T_COMPOSITION VALUES ('CLVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 156);
INSERT INTO T_COMPOSITION VALUES ('CLVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 157);
INSERT INTO T_COMPOSITION VALUES ('CLVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 158);
INSERT INTO T_COMPOSITION VALUES ('CLIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 159);
INSERT INTO T_COMPOSITION VALUES ('CLX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 160);
INSERT INTO T_COMPOSITION VALUES ('CLXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 161);
INSERT INTO T_COMPOSITION VALUES ('CLXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 162);
INSERT INTO T_COMPOSITION VALUES ('CLXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 163);
INSERT INTO T_COMPOSITION VALUES ('CLXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 164);
INSERT INTO T_COMPOSITION VALUES ('CLXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 165);
INSERT INTO T_COMPOSITION VALUES ('CLXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 166);
INSERT INTO T_COMPOSITION VALUES ('CLXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 167);
INSERT INTO T_COMPOSITION VALUES ('CLXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 168);
INSERT INTO T_COMPOSITION VALUES ('CLXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 169);
INSERT INTO T_COMPOSITION VALUES ('CLXX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 170);
INSERT INTO T_COMPOSITION VALUES ('CLXXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 171);
INSERT INTO T_COMPOSITION VALUES ('CLXXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 172);
INSERT INTO T_COMPOSITION VALUES ('CLXXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 173);
INSERT INTO T_COMPOSITION VALUES ('CLXXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 174);
INSERT INTO T_COMPOSITION VALUES ('CLXXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 175);
INSERT INTO T_COMPOSITION VALUES ('CLXXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 176);
INSERT INTO T_COMPOSITION VALUES ('CLXXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 177);
INSERT INTO T_COMPOSITION VALUES ('CLXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 178);
INSERT INTO T_COMPOSITION VALUES ('CLXXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 179);
INSERT INTO T_COMPOSITION VALUES ('CLXXX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 180);
INSERT INTO T_COMPOSITION VALUES ('CLXXXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 181);
INSERT INTO T_COMPOSITION VALUES ('CLXXXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 182);
INSERT INTO T_COMPOSITION VALUES ('CLXXXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 183);
INSERT INTO T_COMPOSITION VALUES ('CLXXXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 184);
INSERT INTO T_COMPOSITION VALUES ('CLXXXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 185);
INSERT INTO T_COMPOSITION VALUES ('CLXXXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 186);
INSERT INTO T_COMPOSITION VALUES ('CLXXXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 187);
INSERT INTO T_COMPOSITION VALUES ('CLXXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 188);
INSERT INTO T_COMPOSITION VALUES ('CLXXXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 189);
INSERT INTO T_COMPOSITION VALUES ('CXC', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 190);
INSERT INTO T_COMPOSITION VALUES ('CXCI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 191);
INSERT INTO T_COMPOSITION VALUES ('CXCII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 192);
INSERT INTO T_COMPOSITION VALUES ('CXCIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 193);
INSERT INTO T_COMPOSITION VALUES ('CXCIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 194);
INSERT INTO T_COMPOSITION VALUES ('CXCV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 195);
INSERT INTO T_COMPOSITION VALUES ('CXCVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 196);
INSERT INTO T_COMPOSITION VALUES ('CXCVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 197);
INSERT INTO T_COMPOSITION VALUES ('CXCVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 198);
INSERT INTO T_COMPOSITION VALUES ('CXCIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 199);
INSERT INTO T_COMPOSITION VALUES ('CC', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 200);
INSERT INTO T_COMPOSITION VALUES ('CCI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 201);
INSERT INTO T_COMPOSITION VALUES ('CCII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 202);
INSERT INTO T_COMPOSITION VALUES ('CCIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 203);
INSERT INTO T_COMPOSITION VALUES ('CCIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 204);
INSERT INTO T_COMPOSITION VALUES ('CCV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 205);
INSERT INTO T_COMPOSITION VALUES ('CCVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 206);
INSERT INTO T_COMPOSITION VALUES ('CCVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 207);
INSERT INTO T_COMPOSITION VALUES ('CCVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 208);
INSERT INTO T_COMPOSITION VALUES ('CCIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 209);
INSERT INTO T_COMPOSITION VALUES ('CCX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 210);
INSERT INTO T_COMPOSITION VALUES ('CCXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 211);
INSERT INTO T_COMPOSITION VALUES ('CCXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 212);
INSERT INTO T_COMPOSITION VALUES ('CCXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 213);
INSERT INTO T_COMPOSITION VALUES ('CCXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 214);
INSERT INTO T_COMPOSITION VALUES ('CCXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 215);
INSERT INTO T_COMPOSITION VALUES ('CCXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 216);
INSERT INTO T_COMPOSITION VALUES ('CCXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 217);
INSERT INTO T_COMPOSITION VALUES ('CCXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 218);
INSERT INTO T_COMPOSITION VALUES ('CCXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 219);
INSERT INTO T_COMPOSITION VALUES ('CCXX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 220);
INSERT INTO T_COMPOSITION VALUES ('CCXXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 221);
INSERT INTO T_COMPOSITION VALUES ('CCXXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 222);
INSERT INTO T_COMPOSITION VALUES ('CCXXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 223);
INSERT INTO T_COMPOSITION VALUES ('CCXXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 224);
INSERT INTO T_COMPOSITION VALUES ('CCXXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 225);
INSERT INTO T_COMPOSITION VALUES ('CCXXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 226);
INSERT INTO T_COMPOSITION VALUES ('CCXXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 227);
INSERT INTO T_COMPOSITION VALUES ('CCXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 228);
INSERT INTO T_COMPOSITION VALUES ('CCXXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 229);
INSERT INTO T_COMPOSITION VALUES ('CCXXX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 230);
INSERT INTO T_COMPOSITION VALUES ('CCXXXI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 231);
INSERT INTO T_COMPOSITION VALUES ('CCXXXII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 232);
INSERT INTO T_COMPOSITION VALUES ('CCXXXIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 233);
INSERT INTO T_COMPOSITION VALUES ('CCXXXIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 234);
INSERT INTO T_COMPOSITION VALUES ('CCXXXV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 235);
INSERT INTO T_COMPOSITION VALUES ('CCXXXVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 236);
INSERT INTO T_COMPOSITION VALUES ('CCXXXVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 237);
INSERT INTO T_COMPOSITION VALUES ('CCXXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 238);
INSERT INTO T_COMPOSITION VALUES ('CCXXXIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 239);
INSERT INTO T_COMPOSITION VALUES ('CCXL', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 240);
INSERT INTO T_COMPOSITION VALUES ('CCXLI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 241);
INSERT INTO T_COMPOSITION VALUES ('CCXLII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 242);
INSERT INTO T_COMPOSITION VALUES ('CCXLIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 243);
INSERT INTO T_COMPOSITION VALUES ('CCXLIV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 244);
INSERT INTO T_COMPOSITION VALUES ('CCXLV', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 245);
INSERT INTO T_COMPOSITION VALUES ('CCXLVI', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 246);
INSERT INTO T_COMPOSITION VALUES ('CCXLVII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 247);
INSERT INTO T_COMPOSITION VALUES ('CCXLVIII', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 248);
INSERT INTO T_COMPOSITION VALUES ('CCXLIX', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 249);
INSERT INTO T_COMPOSITION VALUES ('CCL', '0000000000', NULL, NULL, NULL, NULL, 'p', NULL, 250);
INSERT INTO T_COMPOSITION VALUES ('I', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 01);
INSERT INTO T_COMPOSITION VALUES ('II', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 02);
INSERT INTO T_COMPOSITION VALUES ('III', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 03);
INSERT INTO T_COMPOSITION VALUES ('IV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 04);
INSERT INTO T_COMPOSITION VALUES ('V', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 05);
INSERT INTO T_COMPOSITION VALUES ('VI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 06);
INSERT INTO T_COMPOSITION VALUES ('VII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 07);
INSERT INTO T_COMPOSITION VALUES ('VIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 08);
INSERT INTO T_COMPOSITION VALUES ('IX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 09);
INSERT INTO T_COMPOSITION VALUES ('X', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 10);
INSERT INTO T_COMPOSITION VALUES ('XI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 11);
INSERT INTO T_COMPOSITION VALUES ('XII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 12);
INSERT INTO T_COMPOSITION VALUES ('XIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 13);
INSERT INTO T_COMPOSITION VALUES ('XIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 14);
INSERT INTO T_COMPOSITION VALUES ('XV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 15);
INSERT INTO T_COMPOSITION VALUES ('XVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 16);
INSERT INTO T_COMPOSITION VALUES ('XVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 17);
INSERT INTO T_COMPOSITION VALUES ('XVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 18);
INSERT INTO T_COMPOSITION VALUES ('XIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 19);
INSERT INTO T_COMPOSITION VALUES ('XX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 20);
INSERT INTO T_COMPOSITION VALUES ('XXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 21);
INSERT INTO T_COMPOSITION VALUES ('XXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 22);
INSERT INTO T_COMPOSITION VALUES ('XXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 23);
INSERT INTO T_COMPOSITION VALUES ('XXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 24);
INSERT INTO T_COMPOSITION VALUES ('XXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 25);
INSERT INTO T_COMPOSITION VALUES ('XXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 26);
INSERT INTO T_COMPOSITION VALUES ('XXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 27);
INSERT INTO T_COMPOSITION VALUES ('XXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 28);
INSERT INTO T_COMPOSITION VALUES ('XXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 29);
INSERT INTO T_COMPOSITION VALUES ('XXX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 30);
INSERT INTO T_COMPOSITION VALUES ('XXXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 31);
INSERT INTO T_COMPOSITION VALUES ('XXXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 32);
INSERT INTO T_COMPOSITION VALUES ('XXXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 33);
INSERT INTO T_COMPOSITION VALUES ('XXXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 34);
INSERT INTO T_COMPOSITION VALUES ('XXXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 35);
INSERT INTO T_COMPOSITION VALUES ('XXXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 36);
INSERT INTO T_COMPOSITION VALUES ('XXXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 37);
INSERT INTO T_COMPOSITION VALUES ('XXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 38);
INSERT INTO T_COMPOSITION VALUES ('XXXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 39);
INSERT INTO T_COMPOSITION VALUES ('XL', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 40);
INSERT INTO T_COMPOSITION VALUES ('XLI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 41);
INSERT INTO T_COMPOSITION VALUES ('XLII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 42);
INSERT INTO T_COMPOSITION VALUES ('XLIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 43);
INSERT INTO T_COMPOSITION VALUES ('XLIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 44);
INSERT INTO T_COMPOSITION VALUES ('XLV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 45);
INSERT INTO T_COMPOSITION VALUES ('XLVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 46);
INSERT INTO T_COMPOSITION VALUES ('XLVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 47);
INSERT INTO T_COMPOSITION VALUES ('XLVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 48);
INSERT INTO T_COMPOSITION VALUES ('XLIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 49);
INSERT INTO T_COMPOSITION VALUES ('L', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 50);
INSERT INTO T_COMPOSITION VALUES ('LI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 51);
INSERT INTO T_COMPOSITION VALUES ('LII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 52);
INSERT INTO T_COMPOSITION VALUES ('LIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 53);
INSERT INTO T_COMPOSITION VALUES ('LIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 54);
INSERT INTO T_COMPOSITION VALUES ('LV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 55);
INSERT INTO T_COMPOSITION VALUES ('LVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 56);
INSERT INTO T_COMPOSITION VALUES ('LVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 57);
INSERT INTO T_COMPOSITION VALUES ('LVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 58);
INSERT INTO T_COMPOSITION VALUES ('LIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 59);
INSERT INTO T_COMPOSITION VALUES ('LX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 60);
INSERT INTO T_COMPOSITION VALUES ('LXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 61);
INSERT INTO T_COMPOSITION VALUES ('LXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 62);
INSERT INTO T_COMPOSITION VALUES ('LXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 63);
INSERT INTO T_COMPOSITION VALUES ('LXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 64);
INSERT INTO T_COMPOSITION VALUES ('LXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 65);
INSERT INTO T_COMPOSITION VALUES ('LXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 66);
INSERT INTO T_COMPOSITION VALUES ('LXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 67);
INSERT INTO T_COMPOSITION VALUES ('LXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 68);
INSERT INTO T_COMPOSITION VALUES ('LXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 69);
INSERT INTO T_COMPOSITION VALUES ('LXX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 70);
INSERT INTO T_COMPOSITION VALUES ('LXXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 71);
INSERT INTO T_COMPOSITION VALUES ('LXXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 72);
INSERT INTO T_COMPOSITION VALUES ('LXXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 73);
INSERT INTO T_COMPOSITION VALUES ('LXXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 74);
INSERT INTO T_COMPOSITION VALUES ('LXXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 75);
INSERT INTO T_COMPOSITION VALUES ('LXXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 76);
INSERT INTO T_COMPOSITION VALUES ('LXXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 77);
INSERT INTO T_COMPOSITION VALUES ('LXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 78);
INSERT INTO T_COMPOSITION VALUES ('LXXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 79);
INSERT INTO T_COMPOSITION VALUES ('LXXX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 80);
INSERT INTO T_COMPOSITION VALUES ('LXXXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 81);
INSERT INTO T_COMPOSITION VALUES ('LXXXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 82);
INSERT INTO T_COMPOSITION VALUES ('LXXXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 83);
INSERT INTO T_COMPOSITION VALUES ('LXXXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 84);
INSERT INTO T_COMPOSITION VALUES ('LXXXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 85);
INSERT INTO T_COMPOSITION VALUES ('LXXXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 86);
INSERT INTO T_COMPOSITION VALUES ('LXXXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 87);
INSERT INTO T_COMPOSITION VALUES ('LXXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 88);
INSERT INTO T_COMPOSITION VALUES ('LXXXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 89);
INSERT INTO T_COMPOSITION VALUES ('XC', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 90);
INSERT INTO T_COMPOSITION VALUES ('XCI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 91);
INSERT INTO T_COMPOSITION VALUES ('XCII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 92);
INSERT INTO T_COMPOSITION VALUES ('XCIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 93);
INSERT INTO T_COMPOSITION VALUES ('XCIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 94);
INSERT INTO T_COMPOSITION VALUES ('XCV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 95);
INSERT INTO T_COMPOSITION VALUES ('XCVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 96);
INSERT INTO T_COMPOSITION VALUES ('XCVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 97);
INSERT INTO T_COMPOSITION VALUES ('XCVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 98);
INSERT INTO T_COMPOSITION VALUES ('XCIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 99);
INSERT INTO T_COMPOSITION VALUES ('C', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 100);
INSERT INTO T_COMPOSITION VALUES ('CI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 101);
INSERT INTO T_COMPOSITION VALUES ('CII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 102);
INSERT INTO T_COMPOSITION VALUES ('CIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 103);
INSERT INTO T_COMPOSITION VALUES ('CIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 104);
INSERT INTO T_COMPOSITION VALUES ('CV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 105);
INSERT INTO T_COMPOSITION VALUES ('CVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 106);
INSERT INTO T_COMPOSITION VALUES ('CVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 107);
INSERT INTO T_COMPOSITION VALUES ('CVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 108);
INSERT INTO T_COMPOSITION VALUES ('CIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 109);
INSERT INTO T_COMPOSITION VALUES ('CX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 110);
INSERT INTO T_COMPOSITION VALUES ('CXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 111);
INSERT INTO T_COMPOSITION VALUES ('CXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 112);
INSERT INTO T_COMPOSITION VALUES ('CXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 113);
INSERT INTO T_COMPOSITION VALUES ('CXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 114);
INSERT INTO T_COMPOSITION VALUES ('CXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 115);
INSERT INTO T_COMPOSITION VALUES ('CXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 116);
INSERT INTO T_COMPOSITION VALUES ('CXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 117);
INSERT INTO T_COMPOSITION VALUES ('CXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 118);
INSERT INTO T_COMPOSITION VALUES ('CXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 119);
INSERT INTO T_COMPOSITION VALUES ('CXX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 120);
INSERT INTO T_COMPOSITION VALUES ('CXXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 121);
INSERT INTO T_COMPOSITION VALUES ('CXXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 122);
INSERT INTO T_COMPOSITION VALUES ('CXXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 123);
INSERT INTO T_COMPOSITION VALUES ('CXXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 124);
INSERT INTO T_COMPOSITION VALUES ('CXXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 125);
INSERT INTO T_COMPOSITION VALUES ('CXXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 126);
INSERT INTO T_COMPOSITION VALUES ('CXXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 127);
INSERT INTO T_COMPOSITION VALUES ('CXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 128);
INSERT INTO T_COMPOSITION VALUES ('CXXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 129);
INSERT INTO T_COMPOSITION VALUES ('CXXX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 130);
INSERT INTO T_COMPOSITION VALUES ('CXXXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 131);
INSERT INTO T_COMPOSITION VALUES ('CXXXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 132);
INSERT INTO T_COMPOSITION VALUES ('CXXXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 133);
INSERT INTO T_COMPOSITION VALUES ('CXXXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 134);
INSERT INTO T_COMPOSITION VALUES ('CXXXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 135);
INSERT INTO T_COMPOSITION VALUES ('CXXXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 136);
INSERT INTO T_COMPOSITION VALUES ('CXXXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 137);
INSERT INTO T_COMPOSITION VALUES ('CXXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 138);
INSERT INTO T_COMPOSITION VALUES ('CXXXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 139);
INSERT INTO T_COMPOSITION VALUES ('CXL', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 140);
INSERT INTO T_COMPOSITION VALUES ('CXLI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 141);
INSERT INTO T_COMPOSITION VALUES ('CXLII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 142);
INSERT INTO T_COMPOSITION VALUES ('CXLIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 143);
INSERT INTO T_COMPOSITION VALUES ('CXLIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 144);
INSERT INTO T_COMPOSITION VALUES ('CXLV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 145);
INSERT INTO T_COMPOSITION VALUES ('CXLVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 146);
INSERT INTO T_COMPOSITION VALUES ('CXLVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 147);
INSERT INTO T_COMPOSITION VALUES ('CXLVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 148);
INSERT INTO T_COMPOSITION VALUES ('CXLIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 149);
INSERT INTO T_COMPOSITION VALUES ('CL', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 150);
INSERT INTO T_COMPOSITION VALUES ('CLI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 151);
INSERT INTO T_COMPOSITION VALUES ('CLII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 152);
INSERT INTO T_COMPOSITION VALUES ('CLIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 153);
INSERT INTO T_COMPOSITION VALUES ('CLIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 154);
INSERT INTO T_COMPOSITION VALUES ('CLV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 155);
INSERT INTO T_COMPOSITION VALUES ('CLVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 156);
INSERT INTO T_COMPOSITION VALUES ('CLVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 157);
INSERT INTO T_COMPOSITION VALUES ('CLVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 158);
INSERT INTO T_COMPOSITION VALUES ('CLIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 159);
INSERT INTO T_COMPOSITION VALUES ('CLX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 160);
INSERT INTO T_COMPOSITION VALUES ('CLXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 161);
INSERT INTO T_COMPOSITION VALUES ('CLXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 162);
INSERT INTO T_COMPOSITION VALUES ('CLXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 163);
INSERT INTO T_COMPOSITION VALUES ('CLXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 164);
INSERT INTO T_COMPOSITION VALUES ('CLXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 165);
INSERT INTO T_COMPOSITION VALUES ('CLXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 166);
INSERT INTO T_COMPOSITION VALUES ('CLXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 167);
INSERT INTO T_COMPOSITION VALUES ('CLXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 168);
INSERT INTO T_COMPOSITION VALUES ('CLXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 169);
INSERT INTO T_COMPOSITION VALUES ('CLXX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 170);
INSERT INTO T_COMPOSITION VALUES ('CLXXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 171);
INSERT INTO T_COMPOSITION VALUES ('CLXXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 172);
INSERT INTO T_COMPOSITION VALUES ('CLXXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 173);
INSERT INTO T_COMPOSITION VALUES ('CLXXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 174);
INSERT INTO T_COMPOSITION VALUES ('CLXXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 175);
INSERT INTO T_COMPOSITION VALUES ('CLXXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 176);
INSERT INTO T_COMPOSITION VALUES ('CLXXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 177);
INSERT INTO T_COMPOSITION VALUES ('CLXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 178);
INSERT INTO T_COMPOSITION VALUES ('CLXXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 179);
INSERT INTO T_COMPOSITION VALUES ('CLXXX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 180);
INSERT INTO T_COMPOSITION VALUES ('CLXXXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 181);
INSERT INTO T_COMPOSITION VALUES ('CLXXXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 182);
INSERT INTO T_COMPOSITION VALUES ('CLXXXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 183);
INSERT INTO T_COMPOSITION VALUES ('CLXXXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 184);
INSERT INTO T_COMPOSITION VALUES ('CLXXXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 185);
INSERT INTO T_COMPOSITION VALUES ('CLXXXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 186);
INSERT INTO T_COMPOSITION VALUES ('CLXXXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 187);
INSERT INTO T_COMPOSITION VALUES ('CLXXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 188);
INSERT INTO T_COMPOSITION VALUES ('CLXXXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 189);
INSERT INTO T_COMPOSITION VALUES ('CXC', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 190);
INSERT INTO T_COMPOSITION VALUES ('CXCI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 191);
INSERT INTO T_COMPOSITION VALUES ('CXCII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 192);
INSERT INTO T_COMPOSITION VALUES ('CXCIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 193);
INSERT INTO T_COMPOSITION VALUES ('CXCIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 194);
INSERT INTO T_COMPOSITION VALUES ('CXCV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 195);
INSERT INTO T_COMPOSITION VALUES ('CXCVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 196);
INSERT INTO T_COMPOSITION VALUES ('CXCVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 197);
INSERT INTO T_COMPOSITION VALUES ('CXCVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 198);
INSERT INTO T_COMPOSITION VALUES ('CXCIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 199);
INSERT INTO T_COMPOSITION VALUES ('CC', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 200);
INSERT INTO T_COMPOSITION VALUES ('CCI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 201);
INSERT INTO T_COMPOSITION VALUES ('CCII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 202);
INSERT INTO T_COMPOSITION VALUES ('CCIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 203);
INSERT INTO T_COMPOSITION VALUES ('CCIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 204);
INSERT INTO T_COMPOSITION VALUES ('CCV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 205);
INSERT INTO T_COMPOSITION VALUES ('CCVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 206);
INSERT INTO T_COMPOSITION VALUES ('CCVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 207);
INSERT INTO T_COMPOSITION VALUES ('CCVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 208);
INSERT INTO T_COMPOSITION VALUES ('CCIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 209);
INSERT INTO T_COMPOSITION VALUES ('CCX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 210);
INSERT INTO T_COMPOSITION VALUES ('CCXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 211);
INSERT INTO T_COMPOSITION VALUES ('CCXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 212);
INSERT INTO T_COMPOSITION VALUES ('CCXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 213);
INSERT INTO T_COMPOSITION VALUES ('CCXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 214);
INSERT INTO T_COMPOSITION VALUES ('CCXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 215);
INSERT INTO T_COMPOSITION VALUES ('CCXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 216);
INSERT INTO T_COMPOSITION VALUES ('CCXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 217);
INSERT INTO T_COMPOSITION VALUES ('CCXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 218);
INSERT INTO T_COMPOSITION VALUES ('CCXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 219);
INSERT INTO T_COMPOSITION VALUES ('CCXX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 220);
INSERT INTO T_COMPOSITION VALUES ('CCXXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 221);
INSERT INTO T_COMPOSITION VALUES ('CCXXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 222);
INSERT INTO T_COMPOSITION VALUES ('CCXXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 223);
INSERT INTO T_COMPOSITION VALUES ('CCXXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 224);
INSERT INTO T_COMPOSITION VALUES ('CCXXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 225);
INSERT INTO T_COMPOSITION VALUES ('CCXXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 226);
INSERT INTO T_COMPOSITION VALUES ('CCXXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 227);
INSERT INTO T_COMPOSITION VALUES ('CCXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 228);
INSERT INTO T_COMPOSITION VALUES ('CCXXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 229);
INSERT INTO T_COMPOSITION VALUES ('CCXXX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 230);
INSERT INTO T_COMPOSITION VALUES ('CCXXXI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 231);
INSERT INTO T_COMPOSITION VALUES ('CCXXXII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 232);
INSERT INTO T_COMPOSITION VALUES ('CCXXXIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 233);
INSERT INTO T_COMPOSITION VALUES ('CCXXXIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 234);
INSERT INTO T_COMPOSITION VALUES ('CCXXXV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 235);
INSERT INTO T_COMPOSITION VALUES ('CCXXXVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 236);
INSERT INTO T_COMPOSITION VALUES ('CCXXXVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 237);
INSERT INTO T_COMPOSITION VALUES ('CCXXXVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 238);
INSERT INTO T_COMPOSITION VALUES ('CCXXXIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 239);
INSERT INTO T_COMPOSITION VALUES ('CCXL', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 240);
INSERT INTO T_COMPOSITION VALUES ('CCXLI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 241);
INSERT INTO T_COMPOSITION VALUES ('CCXLII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 242);
INSERT INTO T_COMPOSITION VALUES ('CCXLIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 243);
INSERT INTO T_COMPOSITION VALUES ('CCXLIV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 244);
INSERT INTO T_COMPOSITION VALUES ('CCXLV', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 245);
INSERT INTO T_COMPOSITION VALUES ('CCXLVI', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 246);
INSERT INTO T_COMPOSITION VALUES ('CCXLVII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 247);
INSERT INTO T_COMPOSITION VALUES ('CCXLVIII', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 248);
INSERT INTO T_COMPOSITION VALUES ('CCXLIX', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 249);
INSERT INTO T_COMPOSITION VALUES ('CCL', '0000000000', NULL, NULL, NULL, NULL, 'c', NULL, 250);
INSERT INTO T_ARTICLE VALUES (0050, 'Чл.108а, ал.1 НК', 1);
INSERT INTO T_ARTICLE VALUES (0051, 'Чл.108а, ал.2 НК', 1);
INSERT INTO T_ARTICLE VALUES (0060, 'Чл.109 НК', 1);
INSERT INTO T_ARTICLE VALUES (0070, 'Чл.110 НК', 1);
INSERT INTO T_ARTICLE VALUES (0090, 'Чл.116, ал.1 т.10 НК', 1);
INSERT INTO T_ARTICLE VALUES (0095, 'Чл.116, ал.1 т.7 НК', 1);
INSERT INTO T_ARTICLE VALUES (0300, 'Чл.194 НК', 1);
INSERT INTO T_ARTICLE VALUES (0310, 'Чл.195 НК', 1);
INSERT INTO T_ARTICLE VALUES (0315, 'Чл.196 НК', 1);
INSERT INTO T_ARTICLE VALUES (0320, 'Чл.196а НК', 1);
INSERT INTO T_ARTICLE VALUES (0330, 'Чл.198 НК', 1);
INSERT INTO T_ARTICLE VALUES (0335, 'Чл.199 НК', 1);
INSERT INTO T_ARTICLE VALUES (0340, 'Чл.200 НК', 1);
INSERT INTO T_ARTICLE VALUES (0355, 'Чл.203 НК', 1);
INSERT INTO T_ARTICLE VALUES (0390, 'Чл.209 НК', 1);
INSERT INTO T_ARTICLE VALUES (0395, 'Чл.210 НК', 1);
INSERT INTO T_ARTICLE VALUES (0400, 'Чл.211 НК', 1);
INSERT INTO T_ARTICLE VALUES (0405, 'Чл.212 НК (без ал.5)', 1);
INSERT INTO T_ARTICLE VALUES (0510, 'Чл.212, ал.5 НК', 1);
INSERT INTO T_ARTICLE VALUES (0515, 'Чл.212а НК', 1);
INSERT INTO T_ARTICLE VALUES (0520, 'Чл.213 НК', 1);
INSERT INTO T_ARTICLE VALUES (0525, 'Чл.213а НК (без ал.3 и 4)',1);
INSERT INTO T_ARTICLE VALUES (0528, 'Чл.213а, ал.3 НК', 1);
INSERT INTO T_ARTICLE VALUES (0529, 'Чл.213а, ал.4 НК', 1);
INSERT INTO T_ARTICLE VALUES (0530, 'Чл.214 НК (без ал.2)', 1);
INSERT INTO T_ARTICLE VALUES (0532, 'Чл.214, ал.2 НК', 1);
INSERT INTO T_ARTICLE VALUES (0600, 'Чл.242 НК (без ал.2 и 3)', 1);
INSERT INTO T_ARTICLE VALUES (0602, 'Чл.242, ал.2 НК', 1);
INSERT INTO T_ARTICLE VALUES (0603, 'Чл.242, ал.3 НК', 1);
INSERT INTO T_ARTICLE VALUES (0610, 'Чл.242а НК', 1);
INSERT INTO T_ARTICLE VALUES (0615, 'Чл.243 НК', 1);
INSERT INTO T_ARTICLE VALUES (0620, 'Чл.244 НК', 1);
INSERT INTO T_ARTICLE VALUES (0625, 'Чл.245 НК', 1);
INSERT INTO T_ARTICLE VALUES (0630, 'Чл.246 НК', 1);
INSERT INTO T_ARTICLE VALUES (0640, 'Чл.250 НК', 1);
INSERT INTO T_ARTICLE VALUES (0645, 'Чл.251 НК', 1);
INSERT INTO T_ARTICLE VALUES (0650, 'Чл.252 НК', 1);
INSERT INTO T_ARTICLE VALUES (0655, 'Чл.253 НК (без ал.4)', 1);
INSERT INTO T_ARTICLE VALUES (0660, 'Чл.253, ал.4 НК', 1);
INSERT INTO T_ARTICLE VALUES (0670, 'Чл.253а НК', 1);
INSERT INTO T_ARTICLE VALUES (0680, 'Чл.255 НК', 1);
INSERT INTO T_ARTICLE VALUES (0685, 'Чл.255а НК', 1);
INSERT INTO T_ARTICLE VALUES (0690, 'Чл.257, ал.1 НК', 1);
INSERT INTO T_ARTICLE VALUES (0710, 'Чл.282 НК', 1);
INSERT INTO T_ARTICLE VALUES (0730, 'Чл.301 НК (без ал.5)', 1);
INSERT INTO T_ARTICLE VALUES (0731, 'Чл.301, ал.5 НК', 1);
INSERT INTO T_ARTICLE VALUES (0735, 'Чл.302 НК', 1);
INSERT INTO T_ARTICLE VALUES (0740, 'Чл.303 НК', 1);
INSERT INTO T_ARTICLE VALUES (0745, 'Чл.304 НК (без ал.3)', 1);
INSERT INTO T_ARTICLE VALUES (0750, 'Чл.304, ал.3 НК', 1);
INSERT INTO T_ARTICLE VALUES (0755, 'Чл.304а НК', 1);
INSERT INTO T_ARTICLE VALUES (0760, 'Чл.304б НК', 1);
INSERT INTO T_ARTICLE VALUES (0765, 'Чл.305 НК', 1);
INSERT INTO T_ARTICLE VALUES (0770, 'Чл.305а НК', 1);
INSERT INTO T_ARTICLE VALUES (0775, 'Чл.306 НК', 1);
INSERT INTO T_ARTICLE VALUES (0800, 'Чл.321 НК', 1);
INSERT INTO T_ARTICLE VALUES (0805, 'Чл.321а НК', 1);
INSERT INTO T_ARTICLE VALUES (0860, 'Чл.354а НК', 1);
INSERT INTO T_ARTICLE VALUES (0861, 'Чл.354б НК', 1);
INSERT INTO T_ARTICLE VALUES (0862, 'Чл.354в НК (без ал.2, 3, и 4)', 1);
INSERT INTO T_ARTICLE VALUES (0864, 'Чл.354в, ал.2 НК', 1);
INSERT INTO T_ARTICLE VALUES (0865, 'Чл.354в, ал.3 НК', 1);
INSERT INTO T_ARTICLE VALUES (0866, 'Чл.354в, ал.4 НК', 1);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0050, 0101);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0051, 0101);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0060, 0100);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0070, 0100);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0090, 0201);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0090, 0202);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0095, 0201);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0095, 0202);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0300, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0310, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0315, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0320, 0504);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0330, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0335, 0505);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0340, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0355, 0507);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0390, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0395, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0400, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0405, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0510, 0511);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0515, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0520, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0525, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0528, 0513);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0529, 0513);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0530, 0500);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0532, 0513);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0600, 0600);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0602, 0602);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0603, 0602);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0610, 0600);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0615, 0603);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0620, 0603);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0625, 0603);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0630, 0603);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0640, 0603);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0645, 0600);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0650, 0600);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0655, 0700);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0660, 0701);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0670, 0700);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0680, 0703);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0685, 0703);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0690, 0703);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0710, 0801);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0730, 0806);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0731, 0802);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0735, 0806);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0740, 0806);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0745, 0806);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0750, 0803);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0755, 0806);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0760, 0804);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0765, 0806);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0770, 0805);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0775, 0806);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0800, 1002);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0805, 1002);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0860, 1106);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0861, 1106);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0862, 1100);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0864, 1106);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0865, 1106);
INSERT INTO T_OLD_ARTICLE_SUBJECT VALUES (0866, 1106);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (010110900, 0100);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020111600, 0201);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020111600, 0202);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020111601, 0201);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020111601, 0202);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020111700, 0201);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020111700, 0202);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020111701, 0201);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020111701, 0202);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020213100, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020213101, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020213102, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414200, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414200, 0204);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414201, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414201, 0204);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414202, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414202, 0204);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414203, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414204, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414205, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414300, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414301, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414302, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020414400, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020715500, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020715501, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020715600, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020715900, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (020915900, 0200);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050119500, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050119501, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050119502, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050119503, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050119600, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050119601, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050119602, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050119602, 0504);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050119603, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050119603, 0504);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050219900, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050219900, 0505);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050219901, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050219901, 0505);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050220000, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050220001, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521300, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521301, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521301, 0513);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521302, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521302, 0513);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521303, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521303, 0513);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521400, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521400, 0513);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521401, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521401, 0513);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521402, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521402, 0513);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521403, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521404, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521405, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521406, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521407, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521408, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521409, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521410, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521411, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521412, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521413, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521414, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521415, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050521416, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050721600, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050721601, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (050721602, 0500);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060122500, 0600);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060122500, 0601);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060122501, 0600);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060223500, 0600);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060223501, 0600);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060223502, 0600);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060223503, 0600);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060324200, 0600);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060324200, 0602);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060324201, 0600);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060324201, 0602);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060324202, 0600);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060324202, 0602);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (060324600, 0603);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (070125300, 0700);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (070125301, 0700);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (070125301, 0701);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (070125302, 0700);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (070125303, 0700);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (070125600, 0703);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (070125601, 0703);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080128000, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080228200, 0801);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080228210, 0801);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430100, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430100, 0806);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430110, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430110, 0802);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430200, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430200, 0806);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430400, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430400, 0806);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430410, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430410, 0803);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430420, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430420, 0806);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430430, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430430, 0804);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430500, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430500, 0806);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430510, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430510, 0805);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (080430510, 0806);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (090130800, 0800);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (100132100, 1002);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (100132110, 1002);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110133000, 1101);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110133001, 1101);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110133002, 1100);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110234600, 1100);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110335400, 1106);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110335401, 1106);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110335402, 1106);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110435600, 1100);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110435601, 1100);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110435602, 1100);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110435603, 1100);
INSERT INTO T_OLD_DANGER_SUBJECT VALUES (110435604, 1100);
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 10000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 10000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 10000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 10100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 10100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 10100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 10200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 10200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 10200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 10300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 10300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 10300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 10400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 10400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 10400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 10500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 10500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 10500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 10600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 10600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 10600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 10700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 10700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 10700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 10800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 10800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 10800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 10900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 10900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 10900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 11000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 11000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 11000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 11100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 11100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 11100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 11200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 11200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 11200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 11400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 11400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 11400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 11300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 101 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 11300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 101;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 11300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 101;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 20000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 20000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 20000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 20500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 20500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 20500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 20600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 20600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 20600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 20700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 20700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 20700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 20800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 20800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 20800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 20900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 20900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 20900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 21100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 21100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 21100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 21200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 21200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 21200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 21300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 21300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 21300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 21400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 21400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 21400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 21500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 21500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 21500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 21600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 21600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 21600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 30000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 30000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 30000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 30100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 30100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 30100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 30200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 30200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 30200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 30300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 30300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 30300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 30400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 30400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 30400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 30600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 30600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 30600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 30700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 30700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 30700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 30800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 30800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 30800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 30900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 30900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 30900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 31000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 31000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 31000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 31100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 31100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 31100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 31200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 31200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 31200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 40000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 40000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 40000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 40100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 40100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 40100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 40200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 40200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 40200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 40300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 40300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 40300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 40400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 40400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 40400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 40500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 40500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 40500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 40600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 40600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 40600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 41600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 41600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 41600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 41700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 41700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 41700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 41800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 41800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 41800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 42000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 42000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 42000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 42100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 42100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 42100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 42200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 42200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 42200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 42300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 42300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 42300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 42400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 42400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 42400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 42500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 42500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 42500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 42600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 42600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 42600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 42700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 42700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 42700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 42800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 42800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 42800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 43200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 43200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 43200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 43300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 43300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 43300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 43400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 43400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 43400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 43600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 43600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 43600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 43700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 43700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 43700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 44100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 44100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 44100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 44200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 44200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 44200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 44300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 44300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 44300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 44700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 44700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 44700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 20100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 20100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 201;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 20100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 201;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 20200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 20200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 201;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 20200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 201;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 20300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 201 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 20300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 201;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 20300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 201;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 20400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 202 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 20400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 202;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 20400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 202;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 21000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 21000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 203;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 21000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 203;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 30500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 203 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 30500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 203;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 30500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 203;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 40700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 40700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 40700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 40800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 40800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 40800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 40900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 40900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 40900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 41000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 41000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 41000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 41100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 41100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 41100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 41300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 41300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 41300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 41400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 41400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 41400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 41500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 41500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 41500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 43800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 43800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 43800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 43900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 43900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 43900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 44000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 204 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 44000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 44000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 204;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 41200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 205 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 41200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 205;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 41200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 205;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 41900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 41900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 207;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 41900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 207;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 42900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 42900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 207;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 42900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 207;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 43000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 43000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 207;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 43000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 207;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 43100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 207 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 43100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 207;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 43100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 207;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 43500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 208 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 43500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 208;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 43500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 208;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 44400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 44400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 206;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 44400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 206;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 44500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 44500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 206;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 44500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 206;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 44600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 206 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 44600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 206;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 44600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 206;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 50000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 50000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 50000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 50100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 50100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 50100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 50200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 50200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 50200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 50300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 50300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 50300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 50400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 50400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 50400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 50500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 50500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 50500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 50600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 50600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 50600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 50700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 50700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 50700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 50800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 50800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 50800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 50900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 50900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 50900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 51000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 51000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 51000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 60000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 60000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 60000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 60100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 60100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 60100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 60200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 60200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 60200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 60300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 60300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 60300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 60400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 60400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 60400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 60500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 60500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 60500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 60600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 60600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 60600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 60700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 400 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 60700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 60700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 400;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 70000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 70000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 70000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 72300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 72300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 72300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 72400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 72400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 72400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 72500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 72500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 72500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 73200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 73200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 73200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 73900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 73900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 73900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 74000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 74000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 74000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 74100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 500 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 74100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 74100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 500;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 70100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 70100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 70100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 70200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 70200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 70200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 70300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 70300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 70300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 70400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 70400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 70400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 70500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 70500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 70500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 70600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 70600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 70600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 70700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 504 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 70700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 70700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 504;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 70800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 70800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 505;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 70800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 505;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 70900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 70900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 505;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 70900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 505;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 71000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 71000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 505;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 71000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 505;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 71100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 505 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 71100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 505;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 71100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 505;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 71200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 71200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 71200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 71300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 71300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 71300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 71400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 71400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 71400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 71500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 71500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 71500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 71600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 71600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 71600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 71700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 71700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 71700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 71800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 71800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 71800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 71900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 71900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 71900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 72000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 72000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 72000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 72100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 72100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 72100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 72200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 507 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 72200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 72200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 507;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 72600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 72600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 72600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 72700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 72700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 72700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 72800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 72800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 72800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 72900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 72900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 72900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 73000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 73000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 73000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 73100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 511 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 73100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 73100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 511;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 73300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 73300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 73300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 73400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 73400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 73400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 73500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 73500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 73500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 73600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 73600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 73600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 73700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 73700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 73700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 73800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 513 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 73800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 73800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 513;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 80000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 80000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 80000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 80100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 80100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 80100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 80200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 80200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 80200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 80300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 80300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 80300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 80400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 80400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 80400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 80500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 80500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 80500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 80600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 80600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 80600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 81000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 81000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 81000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 81100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 81100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 81100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 81200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 81200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 81200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 81300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 81300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 81300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 81400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 81400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 81400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 81500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 81500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 81500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 81600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 81600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 81600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 81700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 81700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 81700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 81800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 81800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 81800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 81900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 81900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 81900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 82100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 600 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 82100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 82100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 600;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 80700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 80700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 601;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 80700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 601;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 80800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 80800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 601;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 80800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 601;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 80900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 601 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 80900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 601;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 80900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 601;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 82000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 82000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 602;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 82000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 602;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 82200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 82200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 602;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 82200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 602;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 82300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 82300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 602;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 82300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 602;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 82400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 82400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 602;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 82400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 602;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 82500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 602 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 82500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 602;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 82500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 602;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 82600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 82600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 82600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 82700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 82700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 82700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 82800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 82800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 82800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 82900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 82900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 82900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 603 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 603;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 84000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 84000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 84000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 84100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 84100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 84100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 84200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 84200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 84200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 701 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 701;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 701;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 702 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 702;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 702;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 703 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 703;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 703;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 90000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 90000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 90000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 90100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 90100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 90100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 90200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 90200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 90200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 90300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 90300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 90300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 90400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 90400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 90400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 90500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 90500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 90500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 90600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 90600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 90600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 90700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 90700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 90700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 90800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 90800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 90800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 90900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 90900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 90900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 91000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 91000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 91000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 91200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 91200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 91200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 91900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 91900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 91900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 92000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 92000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 92000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 92100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 92100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 92100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 92200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 92200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 92200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 92300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 92300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 92300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 92400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 92400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 92400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 92500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 92500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 92500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 92600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 92600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 92600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 92700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 92700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 92700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 92800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 92800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 92800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 92900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 92900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 92900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 93000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 93000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 93000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 93100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 93100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 93100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 91100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 801 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 91100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 801;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 91100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 801;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 91300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 91300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 91300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 91400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 91400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 91400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 91500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 91500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 91500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 91600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 91600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 91600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 91700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 91700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 91700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 91800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 91800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 91800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 93200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 93200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 93200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 93300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 93300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 93300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 93400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 93400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 93400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 93500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 93500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 93500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 93600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 93600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 93600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 93900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 93900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 93900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 94100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 806 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 94100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 94100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 806;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 93700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 802 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 93700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 93700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 802;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 93800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 804 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 93800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 804;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 93800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 804;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 94000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 805 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 94000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 805;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 94000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 805;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 100000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 100000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 100000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 100100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 100100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 100100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 100200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 100200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 100200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 100300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 100300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 100300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 100400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 100400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 100400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 100500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 100500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 100500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 100600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 100600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 100600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 100700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 900 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 100700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 100700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 900;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 110000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 910 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 110000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 910;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 110000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 910;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 120000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 120000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 120000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 120100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 120100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 120100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 120400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 120400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 120400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 120500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 120500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 120500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 120600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 120600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 120600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 120700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 120700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 120700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 120800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 120800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 120800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 120900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 120900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 120900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 121000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 121000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 121000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 121100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 121100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 121100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 121200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 121200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 121200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 120200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 120200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1002;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 120200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1002;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 120300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1002 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 120300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1002;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 120300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1002;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 130000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 130000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 130000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 130100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 130100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 130100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 130300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 130300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 130300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 130400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 130400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 130400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 130500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 130500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 130500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 130700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 130700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 130700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 130800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 130800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 130800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 130900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 130900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 130900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 131000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 131000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 131000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 131100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 131100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 131100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 131200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 131200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 131200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 131400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 131400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 131400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 131500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 131500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 131500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 131600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 131600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 131600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 131700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 131700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 131700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 131800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 131800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 131800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 131900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 131900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 131900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 132000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 132000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 132000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 132200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 132200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 132200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 132300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 132300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 132300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 132400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 132400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 132400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 132500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 132500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 132500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 132600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 132600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 132600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 132700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 132700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 132700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 132800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 132800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 132800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 132900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 132900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 132900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 133000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 133000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 133000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 133100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 133100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 133100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 133900, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 133900 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 133900 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 134000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1100 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 134000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 134000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1100;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 130200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1101 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 130200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1101;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 130200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1101;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 130600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1102 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 130600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1102;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 130600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1102;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 131300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1104 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 131300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1104;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 131300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1104;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 132100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1105 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 132100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1105;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 132100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1105;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 133200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 133200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 133200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 133300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 133300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 133300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 133400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 133400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 133400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 133500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 133500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 133500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 133600, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 133600 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 133600 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 133700, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1106 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 133700 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 133700 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1106;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 133800, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1107 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 133800 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1107;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 133800 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1107;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 140000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 140000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 140000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 140200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1200 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 140200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1200;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 140200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1200;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 140100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1202 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 140100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1202;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 140100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1202;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 150000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 150000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 150000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 150100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 150100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 150100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 150200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 150200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 150200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 150300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 150300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 150300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 150400, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 150400 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 150400 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 150500, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 150500 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 150500 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 160000, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 160000 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 160000 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 160100, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 160100 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 160100 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 160200, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 160200 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 160200 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 160300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 160300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 160300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1300;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 170000, 'Г'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 200000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 222000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 223000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 224000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 232000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 233000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 241000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 242000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 243000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 250000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 251000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 252000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 253000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 254000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 255000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 256000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 257000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 258000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 234000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 211000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1800 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 212000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2206 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 213000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1400 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 220000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2306 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 221000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2305 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 230000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2303 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 231000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2304 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 240000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1500 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 300000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 308000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 314000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 314100, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 314200, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 315000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 301000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2204 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 302000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2205 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 303000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2216 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 304000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 305000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2218 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 306000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2213 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 307000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2201 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 309000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2222 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 310000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2207 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 311000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2208 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 312000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2209 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 313000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2210 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 400000, 'D'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 438000, 'D'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 438100, 'D'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 439000, 'U'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 3400 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 435000, 'D'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1900 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5000000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 600000, 'C'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9100 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 700000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 701000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 702000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 703000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 704000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 705000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 706000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 707000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 708000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 709000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 710000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 711000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 712000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 713000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 714000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 715000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 716000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 717000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 718000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 719000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 720000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 730000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 800000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 801000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 804000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 805000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 806000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 807000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 808000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9201 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 802000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9202 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 803000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9205 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 809000, 'H'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9204 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 9000000, 'П'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5010000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5010100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5010200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5010300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5010400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5010500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5010600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5010700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5010800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5010900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5011000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5011100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5011200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5011300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5011400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5020000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5020100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5020200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5020300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5020400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5020500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5020600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5020700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5020800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5020900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5021000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5021100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5021200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5021300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5021400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5021500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5021600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5030000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5030100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5030200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5030300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5030400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5030500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5030600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5030700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5030800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5030900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5031000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5031100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5031200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5040000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5040100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5040200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5040300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5040400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5040500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5040600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5040700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5040800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5040900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5041000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5041100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5041200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5041300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5041400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5041500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5041600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5041700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5041800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5041900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5042000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5042100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5042200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5042300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5042400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5042500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5042600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5042700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5042800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5042900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5043000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5043100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5043200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5043300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5043400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5043500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5043600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5043700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5043800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5043900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5044000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5044100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5044200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5044300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5044400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5044500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5044600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5044700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5050000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5050100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5050200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5050300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5050400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5050500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5050600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5050700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5050800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5050900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5051000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5060000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5060100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5060200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5060300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5060400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5060500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5060600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5060700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5070000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5070100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5070200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5070300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5070400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5070500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5070600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5070700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5070800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5070900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5071000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5071100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5071200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5071300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5071400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5071500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5071600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5071700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5071800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5071900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5072000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5072100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5072200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5072300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5072400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5072500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5072600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5072700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5072800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5072900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5073000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5073100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5073200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5073300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5073400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5073500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5073600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5073700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5073800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5073900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5074000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5074100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5080000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5080100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5080200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5080300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5080400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5080500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5080600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5080700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5080800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5080900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5081000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5081100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5081200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5081300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5081400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5081500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5081600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5081700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5081800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5081900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5082000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5082100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5082200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5082300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5082400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5082500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5082600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5082700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5082800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5082900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5084000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5084100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5084200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5090000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5090100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5090200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5090300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5090400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5090500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5090600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5090700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5090800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5090900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5091000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5091100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5091200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5091300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5091400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5091500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5091600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5091700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5091800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5091900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5092000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5092100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5092200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5092300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5092400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5092500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5092600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5092700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5092800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5092900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5093000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5093100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5093200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5093300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5093400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5093500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5093600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5093700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5093800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5093900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5094000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5094100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5100000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5100100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5100200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5100300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5100400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5100500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5100600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5100700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5110000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5120000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5120100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5120200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5120300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5120400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5120500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5120600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5120700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5120800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5120900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5121000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5121100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5121200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5130000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5130100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5130200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5130300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5130400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5130500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5130600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5130700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5130800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5130900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5131000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5131100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5131200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5131300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5131400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5131500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5131600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5131700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5131800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5131900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5132000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5132100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5132200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5132300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5132400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5132500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5132600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5132700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5132800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5132900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5133000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5133100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5133200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5133300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5133400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5133500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5133600, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5133700, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5133800, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5133900, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5134000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5140000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5140100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5140200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5150000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5150100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5150200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5150300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5150400, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5150500, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5160000, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5160100, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5160200, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5160300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 9435000, 'П'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 9438000, 'П'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 9438100, 'П'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9500 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 306100, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2200 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 171000, 'Г'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 172000, 'Г'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 173000, 'Г'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 174000, 'Г'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 175000, 'Г'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2100 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 259000, 'I'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 2300 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 121300, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 1000 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 121300 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 121300 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 1000;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5121300, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 83450, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 700 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 83450 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 83450 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 700;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 99950, 'O'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 800 AND F_TYPE = 'p';
INSERT INTO T_ARTICLE_SUBJECT (F_ARTICLE, F_SUBJECT) SELECT F_ARTICLE, 99950 FROM T_OLD_ARTICLE_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_DANGER_SUBJECT (F_DANGER, F_SUBJECT) SELECT F_DANGER, 99950 FROM T_OLD_DANGER_SUBJECT WHERE F_SUBJECT = 800;
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5083450, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_ARCHIVE_SUBJECT (F_ARCHIVE_INDEX, F_SUBJECT, F_KIND) SELECT F_ARCHIVE_INDEX, 5099950, 'W'
FROM T_OLD_ARCHIVE_SUBJECT WHERE F_SUBJECT = 9000 AND F_TYPE = 'p';
INSERT INTO T_USER VALUES ('0000000000', '__4INTERNAL_USE', NULL, NULL, NULL, 'i', 'O', 1, -514923617, NULL, '81acaaba24d8b00938cb9b985f17d6af', 100, NULL, NULL, 0, NULL, NULL);
INSERT INTO T_USER VALUES ('0000000103', 'COURTA', 'A', 'M9DOqbQy', 'acdpt', 'a', 'O', 1, -514923617, NULL, 'f0727595c51b828707036a9963be7610', 100, NULL, '*****', 0, NULL, NULL);
INSERT INTO T_USER VALUES ('0000000206', 'RESERVED', NULL, NULL, NULL, 'o', 'O', 1, -514923617, NULL, '38e93ca8aaeec054d49036572ecad128', 100, NULL, NULL, 0, NULL, NULL);
COMMIT WORK;
INSERT INTO T_ADDRESS (F_UCN, F_UCN_TYPE, F_ADDRESS, F_UCLP, F_STREET) VALUES ('0000000001', 'B', 1, 10135, 06999);
INSERT INTO T_ADDRESS (F_UCN, F_UCN_TYPE, F_ADDRESS, F_UCLP, F_STREET) VALUES ('0000000009', 's', 1, 10135, 06999);
INSERT INTO T_ADDRESS (F_UCN, F_UCN_TYPE, F_ADDRESS, F_UCLP, F_STREET) VALUES ('0000000900', 'K', 1, 10135, 06999);
INSERT INTO T_ADDRESS (F_UCN, F_UCN_TYPE, F_ADDRESS, F_UCLP, F_STREET) VALUES ('0000000910', 'k', 1, 10135, 06999);
INSERT INTO T_SLC_REASON VALUES (101, 's', 'Обявяване на подсъдимия за общодържавно или международно издирване', 'OГDIWCUHП', 1, 1010);
INSERT INTO T_SLC_REASON VALUES (102, 's', 'Заболяване на подсъдим', 'OГDIWCUHП', 1, 1020);
INSERT INTO T_SLC_REASON VALUES (201, 'l', 'За събиране на доказателства', 'OГDIWCUHП', 1, 2010);
INSERT INTO T_SLC_REASON VALUES (202, 'l', 'Нередовно призоваване /подсъдим, пострадал, свидетел/', 'OГDIWCUHП', 1, 2020);
INSERT INTO T_SLC_REASON VALUES (203, 'l', 'За разглеждане по общия ред', 'OГDIWCUHП', 1, 2030);
INSERT INTO T_SLC_REASON VALUES (204, 'l', 'За изготвяне на съдебна експертиза', 'OГDIWCUHП', 1, 2040);
INSERT INTO T_SLC_REASON VALUES (205, 'l', 'Неявяване на подсъдим', 'OГDIWCUHП', 1, 2050);
INSERT INTO T_SLC_REASON VALUES (206, 'l', 'Неявяване на вещо лице', 'OГDIWCUHП', 1, 2060);
INSERT INTO T_SLC_REASON VALUES (207, 'l', 'Неявяване на свидетел', 'OГDIWCUHП', 1, 2070);
INSERT INTO T_SLC_REASON VALUES (208, 'l', 'Неспазване 7-мо дневен срок за връчване на книжата по чл.254 НПК', 'OГDIWCUHП', 1, 2080);
INSERT INTO T_SLC_REASON VALUES (209, 'l', 'Оттеглено пълномощно', 'OГDIWCUHП', 1, 2090);
INSERT INTO T_SLC_REASON VALUES (210, 'l', 'Отпуск на адвокат', 'OГDIWCUHП', 1, 2100);
INSERT INTO T_SLC_REASON VALUES (211, 'l', 'Служебна ангажираност на съдия-докладчик', 'OГDIWCUHП', 1, 2110);
INSERT INTO T_SLC_REASON VALUES (212, 'l', 'Обявяване на подсъдимия за общодържавно издирване', 'OГDIWCUHП', 1, 2120);
INSERT INTO T_SLC_REASON VALUES (301, 'c', 'За администриране', 'ORDIQЕmcZpr', 1, 3010);
INSERT INTO T_SLC_REASON VALUES (302, 'c', 'За изпълнение на указания', 'ORDIQЕmcZpr', 1, 3020);
INSERT INTO T_SLC_REASON VALUES (303, 'c', 'За комплектоване', 'ORDIQЕmcZpr', 1, 3030);
INSERT INTO T_SLC_REASON VALUES (304, 'c', 'За доразследване', 'ORDIQЕ', 1, 3040);
INSERT INTO T_SLC_REASON VALUES (305, 'c', 'Поради смърт на подсъдимия', 'ORDIQЕ', 1, 3050);
INSERT INTO T_SLC_REASON VALUES (306, 'c', 'За отстраняване на процесуални нарушения', 'ORDIQЕ', 1, 3060);
